{
  "id": 7,
  "title": "Family forming adoption, surrogacy and paid parental leave programs",
  "content": "Company A recognizes that there are many paths to parenthood and provides several programs for eligible team members who want to grow their families.\n· Adoption and Surrogacy Reimbursement Program: Company A offers the Adoption and Surrogacy Reimbursement Program* that reimburses each eligible team member up to $10,000 per lifetime for eligible expenses related to using a surrogate to assist in carrying and giving birth to a child.\nIt also provides eligible team members with financial assistance of up to a lifetime maximum of $10,000 toward qualified expenses related to an eligible adoption.\nNote: The Adoption and Surrogacy Reimbursement Program is offered separately from the Company A medical plans. You don't have to be covered under a Company A medical plan option to receive these benefits .*\n· Paid parental leave: Provides eligible team members with up to eight weeks of paid leave, at 100% of base pay, to bond with their newborn or newly adopted child under the age of 18. The program is available to mothers and fathers, biological or adoptive, as well as parents whose baby is carried via a surrogate.\nIf you have questions or want to learn more about the Adoption and Surrogacy Reimbursement Program, visit www.BenefitsSupportCenter.com or call the Benefits Support Center at 1.855.564.6153. Representatives are available from 8 a.m. to 5 p.m. Central time, Monday through Friday.\nIf you have questions or want to learn more about the Parental Leave Program, contact Sedgwick via WBA Worldwide and log in with your OneID and password. On the WBA Worldwide home page, click Tools and Resources, then Time and Leaves, then the mySedgwick portal link. You may also contact Sedgwick at Company Aleaves@Sedgwick.com or at 1.877.872.0911.\n*To be eligible for the Adoption and Surrogacy Reimbursement Program, you must be a Company A or WBA U.S .- based team member who is aligned to Company A employee benefit plans and programs. For additional eligibility details, review the Benefit Program Overview on the My HR Experience Portal or the Benefits Support Center.\n6\nw PRIDE: Your LGBTQ+ Benefits Guide",
  "page": 6,
  "source": "Company_A_PRIDE_Your_LBGTQ+_Benefits_Guide.pdf"
}