{
  "id": 58,
  "title": "Carrum Health Medical and Surgery Benefit",
  "content": "Subject to limited exceptions, you are required to go through Carrum Health when you need one of the procedures listed below. Your surgery will not be covered by the Plan if you get one of these surgeries outside of Carrum Health:\n· Hip and knee replacement\n· Spinal fusion surgery\n· Bariatric (weight loss) surgery\nYou can choose to use the Carrum Health Medical and Surgery Benefit for other procedures, including:\n· Other orthopedic procedures (e.g., hand, wrist, elbow, shoulder, ankle, foot)\n· Cardiac (heart) surgery\n· Breast and thyroid cancer\n· Remote diagnosis, treatment planning and care guidance for all forms of cancer\nThis benefit gives you access to the providers who are ranked in the top 10% nationally. Company A covers all or most of the procedure and travel costs (including costs for a travel companion over age 18), so you won't worry about traditional health insurance or surprise bills.\nPlus, it provides 100% coverage for eligible expenses-including travel for yourself and your designated travel partner (must be over age 18). Note: The 100% coverage applies after the deductible if you enroll in the HSA Plan option.\nIf your carrier has a COE in place for a procedure not covered by the Carrum Health Medical and Surgery Benefit, you must use that COE. For example, UHC requires COEs for cancer, transplant and fertility procedures, as well as congenital heart disease.\nCarrum Health also includes access to Carrum's Guidance Program for cancer diagnoses. This program gives you access to:\n· A virtual expert second opinion and personalized treatment plan development\n. An oncology-specialized nurse at a Carrum Center of Excellence\n· A dedicated Carrum care team specialist, who will help coordinate your care\nVisit carrum.me/companya or call 1.888.855.7806 for support. You'll also find more information and details in the Carrum SPD Insert posted on the Resource Library page of the Benefits Support Center.\nNote: The Carrum Health Medical and Surgery Benefit is a special benefit for employees, dependents and COBRA participants enrolled in any of the UHC or BCBSIL medical plans, including BCBSIL myVirtualCare Access. Your deductible, copay and coinsurance are fully waived except if you're enrolled in the HSA Plan option. Per IRS regulations, HSA enrollees must pay the federal minimum deductible before additional costs are waived. Travel coverage varies based on the procedure. Per IRS rules, a portion of the covered travel expenses will be reported as taxable income.\n8",
  "page": 21,
  "source": "Company_A_2025_Health&Well-Being_Guide.pdf"
}