{
  "id": 18,
  "title": "Who's eligible?",
  "content": "Eligibility requirements vary based on your job classification:\n· Salaried team members and all support center and centralized services hourly team members become eligible on the day after 30 days of full-time employment.\n· Store, distribution center and area/district office hourly team members are eligible for medical coverage when they work an average of 30 paid hours per week .*\nIf you're eligible, you can enroll in coverage for yourself, your spouse or eligible domestic partner (same-sex or opposite-sex) and your children until the end of the month in which they turn 26.\nIf you enroll dependents, the Benefits Support Center will require you to verify your relationship. Required documentation may include a marriage license, affidavit of domestic partnership, income tax returns and birth certificates for your children.\nFind more eligibility information in the Company A Health and Welfare Plan Summary Plan Description (SPD) posted on the Benefits Support Center website.\nWhile on the site, you can check your 12-week and 52-week average hours. After you're eligible for coverage, click the Monitor Your Benefits Eligibility link to see your hours worked and the estimated number of hours you'll need to work during the current Measurement Period to meet the 30 average hours requirement.\n* Your average hours are reviewed after 60 days of employment to determine eligibility. If your hours at that time average 30 hours or above, coverage is offered and effective on the first of the following month. Otherwise, your hours will be reviewed weekly based on actual hours worked during the most recent 12-week period. If your 12-week average rises to 30 hours or above, coverage is offered and effective on the first of the following month. In the enrollment materials mailed to your home address on file, see the Ongoing Eligibility Determination for Hourly Team Members insert for details.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL HEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE CONTACTS\nBENEFITS AT A GLANCE\n9",
  "page": 9,
  "source": "Company_A_2025_Health&Well-Being_Guide.pdf"
}