{
  "id": 87,
  "title": "Whole Life Insurance + Long-Term Care (LTC) Plan*",
  "content": "Company A offers a new type of financial protection benefit: A Whole Life Insurance benefit that includes a Long-Term Care (LTC) rider. The policy includes three parts-Whole Life Insurance, a Long-Term Care rider and it builds cash you can draw from if needed.\nWhole Life insurance provides lifelong coverage and a cash value component, while the LTC rider adds protection against the potentially high costs of long-term care. You and your spouse/ domestic partner can choose whether to enroll based on your needs.\nThis voluntary benefit allows you to gain confidence in knowing that you have a plan in place to address your future life insurance needs and potential long-term care expenses. If needed, either the Life or the Long-Term Care benefit can be utilized without depleting the value of the other benefit.\nYou have a special opportunity to elect this coverage with a guaranteed rate lock for the life of your coverage. The younger you are when you enroll, the lower your rates will be for the life of your coverage! You can only enroll when you are newly eligible or during Open Enrollment each year. You cannot increase your coverage during the year, but you can drop coverage. You may also choose coverage for your spouse or domestic partner if you enroll in coverage for yourself. If you get married during the year, which is a qualifying life event, you may elect coverage for your new spouse, but only if you are currently enrolled in team member only coverage.\n* Accelerated death benefit with restoration and extension of benefits. This is a voluntary benefit, and you can choose whether to enroll based on your needs.\nThe Whole Life Insurance + LTC through Allstate is being communicated to you for informational purposes only. The benefit is not sponsored by Company A, is not intended to be covered by ERISA and its inclusion in the materials should not be construed as an endorsement of the product.\nThe above benefit(s) may not apply (or may apply differently) to certain union and other team members based on applicable agreements.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 34",
  "page": 34,
  "source": "Company_A_2025_Health&Well-Being_Guide.pdf"
}