{
  "id": 73,
  "title": "Maximize your benefits: Comparing HSA, Healthcare FSA and Dependent Care FSA",
  "content": "Feature\nHealth Savings Account (HSA)\nHealthcare Flexible Spending Account (FSA)\nDependent Care Flexible Spending Account (FSA)\n2025 contribution limits\n· Contribute up to $4,300 individual or $8,500 family tax-free. · Plus an additional $1,000 catch-up contribution if age 55 or older.\n· Contribute up to $3,300 tax-free.\n· Contribute up to $5,000 per year (or $850 for highly compensated employees).\nWhat happens to unused funds?\n· Use the money for eligible medical expenses now, or save it for the future, even into retirement. · Unused HSA dollars carry over from year to year. . Bank account that you own and manage. Any contributions belong to you even if you leave the company or retire.\n· For 2025, you have until December 31, 2025 to incur eligible healthcare expenses. Claims must be submitted by March 31 of the year after the claim was incurred. · You can carry over up to $660 of your unused balance from 2025 to 2026, but you must re-enroll in the healthcare FSA to be eligible. If you don't re-enroll, any carryover balance from 2025 will be forfeited March 31, 2026.\n· Unused funds don't carry over from year to year, so plan carefully. · Claims must be submitted by March 31 of the year after the claim was incurred.\nYou can use it for\nQualified medical expenses, such as: · Doctor's office visits · Dental care · Vision care · Prescription medications · Chiropractic services · Acupuncture · Hearing aids and batteries · Contact lenses/eyeglasses For a full list of qualified medical expenses, visit irs.gov.\nDesigned for health, prescription drug, dental and vision out-of-pocket expenses, such as: · Doctor's office visits · Dental care · Vision care · Prescription medications · Chiropractic services · Acupuncture · Hearing aids and batteries · Contact lenses/eyeglasses For a full list of qualified medical expenses, visit irs.gov. Note: If you choose the HSA medical plan, only a Limited Purpose Healthcare FSA is available for dental and vision expenses until you meet your medical plan deductible.\nDesigned for expenses related to care of a child or dependent adult so you (and your spouse, if married) can work or attend school full-time. Eligible expenses include: · General child care · Before- and after-school care · Summer day camp · Elder care Find a complete list of eligible dependent care expenses at irs.gov/publications/p503.\ncontinued\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL HEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 27\nFeature\nHealth Savings Account (HSA)\nHealthcare Flexible Spending Account (FSA)\nDependent Care Flexible Spending Account (FSA)\nOther details\n· Must enroll in the HSA plan. · You can change your HSA election throughout the year. · Funding your HSA with automatic payroll deductions lowers your taxable income. . As your HSA balance grows, any interest you earn is also tax-free. . You'll receive an HSA debit card from Optum Bank that makes it easy to access your account. . You can only use funds from your HSA after they've been deposited into your account. · To be eligible for the HSA, you can't be covered by Medicaid, Medicare or another non-HDHP medical plan. · While domestic partners are eligible for coverage under an HSA option, HSA reimbursements for their out-of-pocket medical costs aren't considered eligible medical expenses (per the IRS) and will be taxed.\n· The total amount you choose to contribute for the year is taken out of your paycheck over time, but you get the full amount for use as soon as your coverage takes effect. . You can't change your Healthcare FSA election mid-year unless you experience a qualifying life event.\n· The total amount you choose to contribute for the year is taken out of your paycheck over time; you can only request reimbursements for up to the amount you've already contributed for the year. · It's a good idea to speak with a tax professional to determine if the Dependent Care FSA or the federal tax credit provides you with the greatest savings.\nThe above benefit(s) may not apply (or may apply differently) to certain union and other team members based on applicable agreements.\nPAGELAST VIEWED\nBENEFITS AT A GLANCE 28\nCONTACTS\nAND MORE\nFINANCIAL WELL-BEING\nWELL-BEING\nLIFE & DISABILITY\nHEALTH & INSURANCE\nENROLLMENT CENTRAL\nW",
  "page": 28,
  "source": "Company_A_2025_Health&Well-Being_Guide.pdf"
}