{
  "id": 8,
  "title": "Mental health and well-being benefits",
  "content": "We're working hard to reinforce a culture defined by empathy and compassion-one that encourages team members to raise issues and concerns, including those involving their own mental health.\nThat's why the company offers access to the Company A Life365 Employee Assistance Program (EAP). Life365 is available 24/7/365 at no cost to you or your eligible family members .*\nU life365 Access to face-to-face and virtual care advocate visits, online well-being assessments, digital group support, self-help mental health videos, toolkits, articles, resources and concierge services. Life365 cares about the cultural needs and preferences of each participant. By inviting providers to share their personal background and experience, such as language, religion, race, age, gender, LGBTQ+, military service and more, Life365 can tailor referrals more closely to the personal preferences of each individual participant. LGBTQ+ specific support includes: LGBTQ+ tip sheets on Mental Health Care for the LGBTQ+ Community; FAQs from Lesbian, Gay, Bisexual, Transgender, and Questioning (LGBTQ) Prospective Foster and Adoptive Parents; Celebrating Pride Month; Healthcare Coverage Options for Same-sex Couples; Sexual Orientation and Gender Identity Discrimination, and much more.\nAccess support whenever it's needed and wherever it's most convenient for you. Visit companyalife365.com or download the mobile app. Use the group code, life365, to create a personal profile. You can also call 1.855.777.0078 for support 24 hours a day, 7 days a week.\nLife365 ensures no one will know you have accessed the program without your written permission except as required by law.\nNote: Life365 is available more broadly to team members, regardless of health coverage eligibility or participation.\n* Your eligible family members include those living in your home, as well as children living outside of your home up to age 26.\n7\nPRIDE: Your LGBTQ+ Benefits Guide",
  "page": 7,
  "source": "Company_A_PRIDE_Your_LBGTQ+_Benefits_Guide.pdf"
}