{
  "id": 65,
  "title": "Supplemental coverage",
  "content": "MetLife is the provider for Group Critical Illness, Group Hospital Indemnity and Group Accident coverages. Consider enrolling in these supplemental benefit options that provide financial protection for your healthcare expenses. You pay the cost of this coverage through convenient payroll deductions, as you do for your other healthcare coverage. Visit www.metlife.com/info/companya for more information.\nGroup Critical Illness\nGroup Hospital Indemnity\nGroup Accident\nAbout the Plans\n· Pays a cash lump-sum payment if you are diagnosed with a covered critical illness. · The payment can be used for non-medical expenses that health insurance might not cover. · Benefit election payouts of 25% for autism and skin cancer.\n· Pays a cash benefit that can be used to cover your out-of-pocket expenses in case of a covered hospitalization. . You can use the money toward deductibles, copays, premiums and even to help cover your daily living expenses.\n· Pays cash benefits that correspond with hospital confinements due to a covered accident. · The cash benefits can be used to help pay for deductibles, treatment, house payments and more. Note: This coverage is offered in addition to the company's AD&D coverage. That coverage pays a lump-sum benefit to you or your designated beneficiaries if you die or become seriously injured in an accident.\nFor more information about benefit payout amounts, view plan details at www.metlife.com/info/companya.\nThis product is HSA-compatible, so it works well with the HSA medical option, as well as the Copay medical options, to close gaps in coverage. Note: Benefits aren't paid for emergency room treatment or outpatient procedures. IMPORTANT: Refer to the MetLife Group Hospital Indemnity legal disclosure, available in the Resource Library on the Benefits Support Center website.\nNote: If you live in California, your coverage levels may be different than what is shown. It depends on the coverage level you choose. For more information, visit the Benefits Support Center to review your coverage options.\nMetLife is the marketing name used by Metropolitan Life Insurance Company (MLIC) and its affiliates.\nThe supplemental coverage through MetLife is being communicated to you for informational purposes only. The benefit is not sponsored by Company A, is not intended to be covered by ERISA, and its inclusion in the materials should not be construed as an endorsement of the product.\nThe coverage is provided under forms GVCIP4, GVSP2 and GVAP6, or state variations thereof. The coverage has exclusions and limitations. Contact your benefits representative for full details.\nThe above benefit(s) may not apply (or may apply differently) to certain union and other team members based on applicable agreements.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 25",
  "page": 25,
  "source": "Company_A_2025_Health&Well-Being_Guide.pdf"
}