{
  "id": 110,
  "title": "Family forming benefits",
  "content": "Company A recognizes that there are many paths to parenthood and provides several benefits and programs for eligible team members who want to grow their families. We are proud to support our team members by offering financial assistance through our Adoption and Surrogacy Reimbursement Program .*\nFertility coverage: The HSA and Copay medical plan options through UnitedHealthcare and Blue Cross Blue Shield of Illinois provide a lifetime maximum benefit of up to $50,000 for fertility treatment. You aren't required to provide a medical diagnosis, and there is no age limit. These medical plan options also provide fertility preservation services for situations beyond the \"medical necessity\" requirement. There is a $15,000 lifetime maximum for fertility drugs. Contact OptumRx for more information about how these drugs are covered.\nAdoption and Surrogacy Reimbursement Program: Company A offers the Adoption and Surrogacy Reimbursement Program* that reimburses each eligible team member up to $10,000 per lifetime for eligible expenses related to using a surrogate to assist in carrying and giving birth to a child.\nIt also provides eligible team members with financial assistance of up to a lifetime maximum of $10,000 toward qualified expenses related to an eligible adoption.\nNote: The Adoption and Surrogacy Reimbursement Program is offered separately from the Company A medical plans. You don't have to be covered under a Company A medical plan option to receive these benefits.\n* To be eligible for the Adoption and Surrogacy Reimbursement Program, you must be a Company A or WBA U.S .- based team member who is aligned to Company A employee benefit plans and programs. For additional eligibility details, review the Benefit Program Overview on the My HR Experience Portal or the Benefits Support Center.\nThe above benefit(s) may not apply (or may apply differently) to certain union and other team members based on applicable agreements.",
  "page": 41,
  "source": "Company_A_2025_Health&Well-Being_Guide.pdf"
}