[
  {
    "id": 1,
    "title": "",
    "content": "Health & Well-Being\nHello me Time-sensitive enrollment information for your 2025 benefits\nLet's get started\nWalgreens\n1 . TEAM MEMBER REWARDS BER R\\ EMBER REWARDS.\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE\n2"
  },
  {
    "id": 2,
    "title": "Welcome to Walgreens and your 2025 Health & Well-Being Guide!",
    "content": "We're glad you're here!\nYou'll get the most from your enrollment period when you understand all that Walgreens offers, know how your benefits work and make informed choices that help provide coverage and protection for you and your family. This guide provides you with important information about your 2025 benefits."
  },
  {
    "id": 3,
    "title": "ENROLLMENT IS REQUIRED",
    "content": "You must enroll within 31 days of being eligible. Otherwise, you will not have medical coverage or coverage for most other benefits. See the \"What happens if you don't enroll?\" section for more information.\nThere are many ways to view this guide. Choose what works best for you:\nNavigation-click on the arrows to flip to a new page or use the menu at the top of each page to go to a different section.\nPage thumbnails-click on the Page Thumbnail icon at the bottom of your screen to move around the document.\nDownload and print-click on the Download PDF icon at the bottom of your screen to do just that-download a PDF version of the guide to save and print.\nPAGE LAST VIEWED\nW"
  },
  {
    "id": 4,
    "title": "Your benefits at a glance",
    "content": "Health and insurance coverage\nComprehensive health and insurance coverage-with the flexibility to choose what fits your needs\nMedical/Prescription Drug coverage\n>\n· BCBSIL myVirtualCare Access Plan\n· Copay Plan\n· Premier Copay Plan\n· HSA Plan\nSupplemental coverage >\n· Group Critical Illness\n· Group Hospital Indemnity\n· Group Accident\nSpending and savings accounts >\n· Health Savings Account (HSA)\n· Flexible Spending Accounts- Healthcare and Dependent Care\n. Commuter Benefit Plan\nDental coverage >\n· Value PPO Dental\n· Premier PPO Dental\n· Exclusive Network Dental Plan (ENDP)\nVision coverage >\n· Value Vision\n· Premier Vision\nPhysical and emotional well-being\nPhysical and emotional well-being programs offered at no cost\n365 Get Healthy Here (365GHH) >\n· $0 Rx Copay Program for those enrolled in a Walgreens medical plan\n· Tobacco-Free Program\nLife365 Employee Assistance Program (EAP)\n>\nFree flu shots >\nThe Walgreen Benefit Fund >\n>\nWeight Management discounts through PerkSpot\nTime away from work\n>\n· Paid Time Off\n· Holidays\n· Paid Parental Leave\n· Bereavement Leave\nFamily forming benefits >\n· Adoption and Surrogacy Reimbursement Program\n$"
  },
  {
    "id": 5,
    "title": "Financial well-being",
    "content": "Financial well-being programs that help you save now and for the future\nWalgreens Retirement Savings Plan (401(k))\n>\n· Walgreens Student Loan 401(k) Match Program\nFinancial Well-Being through NetBenefits®\n>\nEarnIn >\nAdded Benefits® >\n. Auto and Home Insurance\n· LifeLock Identity Theft Protection\n· MetLife Legal Plans\n· Pet Insurance\n· Purchasing Power\nTeam Member Discount (in-store)\n>\nPerkSpot purchase program, including child care discounts\n>\n>\nAdditional caregiver resources through Life365 EAP\nPAGELAST VIEWED"
  },
  {
    "id": 6,
    "title": "Life and disability insurance",
    "content": "Life and disability protection for you and the people you love\nLife and AD&D insurance >\n· Company-Paid Life\n· Voluntary Life and AD&D Insurance\nWhole Life Insurance + Long-Term Care (LTC) Plan\n>\nDisability coverage >\n. Company-Paid Disability Plan\n· Voluntary Long-Term Disability Plan\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE\n3\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE CONTACTS\nBENEFITS AT A GLANCE\n4"
  },
  {
    "id": 7,
    "title": "1 Log on to the Benefits Support Center website",
    "content": "· Set up your user ID, password and security questions the first time you log on:\n- From work: Authenticate into W Connect or StoreNet using your OneID and password. Then click on the Benefits Support Center Quick Link (no additional credentials are required).\n- From anywhere: Log on to www.BenefitsSupportCenter.com from any personal computer, tablet or smartphone with your user ID and password. Note: For the best viewing experience, please use Firefox, Google Chrome or Microsoft Edge.\n· Want to talk to a live person? Representatives are available at 1.855.564.6153 from 8 a.m. to 5 p.m. Central time, Monday through Friday.\n. Looking for information on the go? Download the Alight Mobile app from the App Store or Google Play. Select Walgreen Co. and then log on with your user ID and password."
  },
  {
    "id": 8,
    "title": "2 Review your choices and enroll",
    "content": "Use the tools and resources on the Benefits Support Center to help you decide, including:\n. This guide-You can download a PDF to review now and keep it for future reference.\n· Provider Search-Find doctors in your network.\n· Plan comparisons-View side-by-side summaries of your medical options."
  },
  {
    "id": 9,
    "title": "Your medical, dental and vision costs",
    "content": "To see what you'll pay for medical, dental and vision coverage and care, get your 2025 estimated costs. (Access code: Stnd2025%#)\nView your 2025 estimated medical, dertil ant vision\nSupporting the needs of our LGBTQ+ community\nLearn how Walgreens provides comprehensive benefit programs for all.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE LIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE\n5"
  },
  {
    "id": 10,
    "title": "What happens if you don't enroll?",
    "content": "You must enroll within 31 days of being eligible. Otherwise, you will not have medical coverage or coverage for most other benefits.\nYou won't be able to add or change coverage until the Open Enrollment for the next calendar year. There are some exceptions to this \"no mid-year changes\" rule if you have a qualifying life event, like marriage, divorce, birth or adoption. You must report your qualifying life event either online through the Benefits Support Center website or by calling the Benefits Support Center within 31 days of the event.\nYou'll find more information in the Walgreens Health and Welfare Plan Summary Plan Description (SPD) that's posted in the Resource Library on the Benefits Support Center."
  },
  {
    "id": 11,
    "title": "Watch for your benefits confirmation statement.",
    "content": "Within an hour after you enroll online on the Benefits Support Center website, you'll receive an email confirming your benefit elections. Your confirmation will come by postal mail if you:\n. Don't enroll by the deadline and default to no medical coverage; or\n· Enroll online, but you don't have an email address on file."
  },
  {
    "id": 12,
    "title": "Keep your information up to date",
    "content": "Visit People Central to confirm your home address so you don't miss important information. Find the link on W Connect or StoreNet > Tools > Applications > People Central.\nPAGELAST VIEWED\n6\nBENEFITS AT A GLANCE\nCONTACTS\nAND MORE\nFINANCIAL WELL-BEING\nWELL-BEING\nLIFE & DISABILITY\nHEALTH & INSURANCE\nENROLLMENT CENTRAL\nW"
  },
  {
    "id": 13,
    "title": "Find important disclosures online",
    "content": "The Enrollment Kit mailed to your home address includes some required notices with helpful information about your benefits, including:\n· The Patient Protection Notice\n· Your Rights and Protections Against Surprise Medical Bills\n· Notice regarding 365 Get Healthy Here (wellness benefits)\n· Protections from disclosure of medical information\n· Availability of summary health information\n· Women's Health and Cancer Rights Act of 1998\n· Genetic Information Nondiscrimination Act (GINA)\n· Women's preventive services: Required health plan coverage guidelines\n. The Newborns' and Mothers' Health Protection Act\n. The Walgreens Health Plans HIPAA Notice of Privacy Practices\n· MetLife Group Hospital Indemnity legal disclosure\nLog on to the Benefits Support Center and select Resource Library from the navigation bar to access electronic copies of these notices and other important plan information, such as Summary Plan Descriptions (SPDs), Summaries of Benefits and Coverage (SBCs) and Summary Annual Reports (SARs). Note: You can also access Summary Annual Reports by selecting the Summary Annual Report Quick Link on the home page.\nPlease note that you may receive additional notices from the Benefits Support Center during and after you enroll as a newly eligible team member. For example, if you add any family members to your Walgreens medical, prescription drug, dental or vision coverage, that family member will receive an up-front notice of his or her right to continue health coverage under COBRA when active coverage ends."
  },
  {
    "id": 14,
    "title": "Questions?",
    "content": "Call the Benefits Support Center at 1.855.564.6153. Representatives are available from 8 a.m. to 5 p.m. Central time, Monday through Friday."
  },
  {
    "id": 15,
    "title": "Important Information",
    "content": "This information is intended to provide an overview of some of the benefit plans for which you may be eligible as a Walgreens team member. If any information in this guide conflicts with the official plan and program documents, those plans and documents will govern. Walgreens reserves the right to amend, modify or terminate these plans and programs at any time. Also, due to existing agreements and/or applicable legal requirements, team member benefits may vary and some of the information in this guide may not apply to you. If you have questions, contact your HR representative. You can also search for benefits information on the Benefits Support Center at www.BenefitsSupportCenter.com.\nCertain union employee and other component groups may have differences in eligibility and/or benefits than described in this guide, based on collective bargaining agreement provisions or otherwise. Team members in these groups should log on to the Benefits Support Center for information about applicable eligibility and benefits.\nMember of Walgreens Boots Alliance\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE\n7"
  },
  {
    "id": 16,
    "title": "Health and insurance coverage",
    "content": "Walgreens offers a comprehensive health and insurance program and gives you the flexibility to choose the coverage that fits your needs."
  },
  {
    "id": 17,
    "title": "ENROLLMENT IS REQUIRED",
    "content": "You must enroll within 31 days of being eligible. Otherwise, you will not have medical coverage or coverage for most other benefits. See the \"What happens if you don't enroll?\" section for more information.\n9\nPreventive screenings, health resources and advocacy programs\nPreventive testing and early detection are vital for identifying health conditions, including cancer, before they progress. Learn about the plans, programs and resources your medical carrier offers to support your health.\nPAGE LAST VIEWED\nW\nENROLLMENT CENTRAL HEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE\n8"
  },
  {
    "id": 18,
    "title": "Who's eligible?",
    "content": "Eligibility requirements vary based on your job classification:\n· Salaried team members and all support center and centralized services hourly team members become eligible on the day after 30 days of full-time employment.\n· Store, distribution center and area/district office hourly team members are eligible for medical coverage when they work an average of 30 paid hours per week .*\nIf you're eligible, you can enroll in coverage for yourself, your spouse or eligible domestic partner (same-sex or opposite-sex) and your children until the end of the month in which they turn 26.\nIf you enroll dependents, the Benefits Support Center will require you to verify your relationship. Required documentation may include a marriage license, affidavit of domestic partnership, income tax returns and birth certificates for your children.\nFind more eligibility information in the Walgreens Health and Welfare Plan Summary Plan Description (SPD) posted on the Benefits Support Center website.\nWhile on the site, you can check your 12-week and 52-week average hours. After you're eligible for coverage, click the Monitor Your Benefits Eligibility link to see your hours worked and the estimated number of hours you'll need to work during the current Measurement Period to meet the 30 average hours requirement.\n* Your average hours are reviewed after 60 days of employment to determine eligibility. If your hours at that time average 30 hours or above, coverage is offered and effective on the first of the following month. Otherwise, your hours will be reviewed weekly based on actual hours worked during the most recent 12-week period. If your 12-week average rises to 30 hours or above, coverage is offered and effective on the first of the following month. In the enrollment materials mailed to your home address on file, see the Ongoing Eligibility Determination for Hourly Team Members insert for details.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL HEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE CONTACTS\nBENEFITS AT A GLANCE\n9"
  },
  {
    "id": 19,
    "title": "Medical coverage",
    "content": "Walgreens offers three medical plan options:\n1 The BCBSIL myVirtualCare Access option makes it easier to access important care virtually from wherever you live. Lower your costs by using a Teladoc virtual PCP to coordinate your care and provide referrals when needed. You can also receive in-person care from in-network providers in BCBSIL's network, without a referral, at the Tier 2 benefits level.\n2 Copay Plan options provide 100% coverage for certain routine services, like office visits, after you pay a copay ($20 per office visit or $35 per specialist office visit). There are two Copay options to choose from (Copay Plan or Premier Copay Plan) with different annual deductibles and out-of-pocket maximums. Copay options have higher per-paycheck costs.\n3 HSA Plan option features lower per-paycheck costs and offer the tax advantage of a Health Savings Account (HSA). There is a combined medical and prescription deductible, which means you'll pay the full cost for all nonpreventive services and prescriptions until the combined medical and prescription drug deductible is met.\nWalgreens has selected a comprehensive and cost-effective medical insurance carrier for your area.\nIMPORTANT: Only in-network coverage (except for emergencies) Using in-network providers is critical. As a general rule, Walgreens medical plans do not cover out-of-network care except in emergencies."
  },
  {
    "id": 20,
    "title": "Your medical, dental and vision costs",
    "content": "To see what you'll pay for medical, dental and vision coverage and care, get your 2025 estimated costs. (Access code: Stnd2025%#)\nView your 2635 ousmeted medical, dental ant vision\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 10"
  },
  {
    "id": 21,
    "title": "How the BCBSIL myVirtualCare Access option works",
    "content": "If you enroll in the BCBSIL myVirtualCare Access medical option, this is how you will receive care under the plan.\nWatch this video to learn more about this convenient and innovative medical plan option."
  },
  {
    "id": 22,
    "title": "Choose your PCP",
    "content": "Select your virtual PCP on the Blue Element Mobile IL mobile app or on myBlueElementIL.com. You can change to a different Teladoc virtual PCP at any time. Plus, each family member who is age 18 or older can choose their own virtual PCP."
  },
  {
    "id": 23,
    "title": "Schedule your first appointment",
    "content": "When you need care, use the Blue Element Mobile IL app to schedule a virtual visit using the Primary 360 tile-choose who needs care, which provider you'd like to see, if you'd like to meet via phone or video, and then select a day and time that works for you. You will also complete an assessment in the app before your visit to provide your PCP with information."
  },
  {
    "id": 24,
    "title": "Prepare for your appointment",
    "content": "You will receive a blood pressure and heart monitor in the mail ahead of your first visit, and you will complete an easy health assessment."
  },
  {
    "id": 25,
    "title": "Meet with your PCP",
    "content": "Meet virtually with your Teladoc virtual PCP to discuss the information you submitted and any other health concerns you have.\n. For care you can't receive virtually, you can choose to receive Tier 1 benefits and lower your costs by using in-network in-person providers referred by your Teladoc virtual PCP (including certain Walgreens Health partners and other BCBSIL Network providers).\n. You also have the option to receive in-person care from any in-network provider in BCBSIL's network, without a referral, at the Tier 2 benefits level.\n+ -"
  },
  {
    "id": 26,
    "title": "Receive your care plan",
    "content": "After your visit, your Teladoc virtual PCP will add your care plan, including any prescriptions, to your member portal. You can have your prescriptions filled at the pharmacy of your choice, subject to the terms of your health plan's prescription benefit and will pay the lesser of the applicable copay or the cost of the drug.\nPAGELAST VIEWED\ncontinued\n11\nBENEFITS AT A GLANCE\nCONTACTS\nAND MORE\nFINANCIAL WELL-BEING\nWELL-BEING\nLIFE & DISABILITY\nHEALTH & INSURANCE\nENROLLMENT CENTRAL\nW\nPAGE LAST VIEWED"
  },
  {
    "id": 27,
    "title": "How the BCBSIL myVirtualCare Access option works continued",
    "content": "If you enroll in BCBSIL my VirtualCare Access, you will select a Teladoc virtual PCP to be your first point of contact. But you are not restricted to receiving \"virtual-only\" or \"telehealth-only\" care. In-person visits to network providers are permitted, and Tier 1 benefits will apply when you are referred by your Teladoc virtual PCP to Walgreens Health partners or a BCBSIL Network provider (otherwise, Tier 2 benefits will apply). Children under age 18 must seek care from participating in-person providers, so their care will be considered Tier 1 whether or not any virtual care is used."
  },
  {
    "id": 28,
    "title": "How you pay for care under this option",
    "content": "All virtual care services through Teladoc are $0, including PCP, specialist, mental health visits, chronic condition management and more. Other common in-person services are available for a flat copay including specialist and mental health visits (under the Tier 2 benefit), labs, basic radiology and urgent care. The amount of your copay will depend on whether you receive a referral from your virtual PCP into Tier 1 or you seek in-person care without a referral under Tier 2.\nIn both Tier 1 and Tier 2, your nonpreventive care is subject to a deductible, coinsurance and an out-of-pocket maximum-but many common healthcare services are available with just a copay.\nPreventive care is always covered at 100% in both Tier 1 and Tier 2. Children under age 18 must seek care from participating in-person providers, so their care will be considered Tier 1 whether or not virtual care is used."
  },
  {
    "id": 29,
    "title": "Have questions?",
    "content": "You can call the BCBSIL myVirtualCare Access plan's customer service number at 1.855.453.4747. Representatives are available Monday through Friday from 9 a.m. to 5 p.m. Central time.\nW\nENROLLMENT CENTRAL HEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 12"
  },
  {
    "id": 30,
    "title": "Your medical plan options at a glance",
    "content": "BCBSIL myVirtualCare Access\nTier 1\nTier 2\nPer Paycheck Costs\nLow\nLow\nPCP (age 18+)\n$0 with Teladoc virtual care $0 copay in-person with referral from virtual PCP (including VillageMD)\n$90 copay\nPediatric Care (under 18)\n$0 copay\n$0 copay\nMental Health Counseling\n$0 copay with Teladoc virtual care $0 copay in-person with referral from virtual PCP (including VillageMD)\n$90 copay\nSpecialists\n$0 copay with Teladoc virtual care $70 copay in-person with referral from virtual PCP (including VillageMD)\n$120 copay\nPreventive Care\n$0 copay\n$0 copay\nLab\n$30 copay with referral from virtual PCP\n$60 copay\nBasic Radiology\n$100 copay with referral from virtual PCP\n$150 copay\nHigh-Cost Radiology: Inpatient Care and Outpatient Care\n30% coinsurance after deductible with referral from virtual PCP\n40% coinsurance after deductible\nOutpatient\n30% coinsurance after deductible with referral from virtual PCP\n40% coinsurance after deductible\nUrgent Care\n$0 copay with Teladoc virtual care $0 copay at VillageMD with referral from virtual PCP $100 copay in-person with referral from virtual PCP\n40% coinsurance after deductible\nEmergency Room\n30% coinsurance after deductible\n30% coinsurance after deductible\nDeductible (individual/family)*\n$4,500/$9,000\n$6,500/$13,000\nOut-of-Pocket Maximum (individual/family)\n$9,000/$18,000\n$9,000/$18,000\nAvailable Spending and Savings Account\nHealthcare FSA\nHealthcare FSA\n* Many services have copays instead of coinsurance and a deductible. Copays count toward the out-of-pocket maximum. Because the annual deductible and out-of-pocket maximum cross apply between two tiers, the Tier 2 amount is the most you will pay.\nPAGELAST VIEWED\ncontinued\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 13"
  },
  {
    "id": 31,
    "title": "Your medical plan options at a glance continued",
    "content": "Copay Plans\nHSA Plan\nCopay Plan\nPremier Copay Plan\nPer Paycheck Costs\nMedium\nHigh\nLow\nOffice Visit Copay\n$20 PCP; $35 Specialist\nDoes not apply; office visits are subject to the deductible and coinsurance\nIn-Network Preventive Care\nCovered at 100%, no deductible\nCovered at 100%, no deductible\nDeductible (individual/family)\n$3,000/$6,000\n$750/$1,500\n$2,000/$4,000\nWalgreens in-store clinic\n$5 copay\nFull price until you meet the deductible. $5 after deductible is met. However, you may be charged the full cost at the time of service or the $5 copay depending on the clinic.\nOutpatient Care\nYou pay 20% after deductible.\nYou pay 20% after deductible.\nMost other services\nYou pay 20% after deductible.\nYou pay 20% after deductible.\nCoinsurance\n20% after deductible\n20% after deductible\nOut-of-Pocket Maximum (individual/family)\n$6,000/$12,000\n$3,500/$7,000\n$5,250/$10,500\nAvailable Spending and Savings Accounts\nHealthcare FSA\nHealth Savings Account Limited Purpose Healthcare FSA\nNote: With the HSA plan, you'll pay the full cost for all nonpreventive services and prescriptions until the combined medical and prescription drug deductible is met before your plan starts paying benefits.\nThe above benefit(s) may not apply (or may apply differently) to certain union and other team members based on applicable agreements.\nThe BCBSIL my VirtualCare Access option works differently from the existing HSA and Copay options. Visit the Benefits Support Center website to watch a video and learn more about this telehealth focused plan."
  },
  {
    "id": 32,
    "title": "Preventive screenings, health resources and advocacy programs",
    "content": "Preventive testing and early detection are vital for identifying health conditions, including cancer, before they progress. Learn about the plans, programs and resources your medical carrier offers to support your health.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 14"
  },
  {
    "id": 33,
    "title": "Prescription drug coverage",
    "content": "Prescription drug coverage is the same under all options:\nBCBSIL myVirtualCare Access\nCopay Plans\nHSA Plan\nTier 1\nTier 2\nCore Premier\nPreventive Drugs1\n$0 for preventive prescriptions\n$0 for preventive prescriptions\n$0 for certain preventive prescriptions\nNonpreventive Drugs\nYou pay the lesser of the copay or the cost of the prescription.\nYou pay the lesser of the copay or the cost of the prescription.\nBefore you meet your plan deductible, you pay the full cost. After the plan deductible is met, you pay the lesser of the copay or the cost of the prescription.\nPrescription Drugs (30- to 90-day supplies)\n30-Day Supply (Retail)\n90-Day Supply (Mail Order through Walgreens Mail Service or at Walgreens)\nGeneric\n$10 copay\n$25 copay2\nBrand Formulary\n$25 copay\n$50 copay\nNon-Formulary\n$50 copay\n$100 copay Fertility coverage"
  },
  {
    "id": 34,
    "title": "Pharmacy benefit manager for BCBSIL and UHC",
    "content": "OptumRx is the pharmacy benefit manager for both BCBSIL and UHC. The same formulary and coverage provisions apply to both carriers. Visit OptumRx's enrollment preview site at welcome.optumrx.com/walgreens or call 1.855.376.3214 before you enroll to research how your current prescriptions will be covered. Note: Mail Order is provided through Walgreens Mail Service or at Walgreens.\nLLLLLL\nW\nThere is a $15,000 lifetime maximum for fertility drugs. Contact OptumRx for more information about how these drugs are covered.\n1 To be considered an eligible preventive drug, the medication must be considered preventive under the Affordable Care Act and as identified under IRS rules-and prescribed by a doctor-even for products sold over the counter (OTC). Also, you must use an in-network retail pharmacy or mail-order service. In the HSA Plan, for other drugs not on the HSA Drug List, you will pay the applicable copay but not the deductible. Visit the OptumRx enrollment preview site at welcome.optumrx.com/walgreens. Call 1.855.376.3214 for additional information.\n2 $20 copay for Kaiser Permanente options offered in California, Washington DC, Maryland and Virginia.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL HEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE\n15"
  },
  {
    "id": 35,
    "title": "$0 Rx Copay Program",
    "content": "If you or any of your covered dependents enrolled in a Walgreens medical plan are being treated for high cholesterol, coronary artery disease, diabetes, high blood pressure (hypertension), asthma, and/or weight loss, you may be eligible for this program.\nTo learn more about the $0 Rx Copay Program, refer to the $0 Rx Copay Program Rewards Resource on the My HR Experience Portal or call OptumRx at 1.855.376.3214."
  },
  {
    "id": 36,
    "title": "Nebulizers and peak flow meters",
    "content": "You can receive selected brand nebulizers and peak flow meters under your prescription benefit for a preferred copay."
  },
  {
    "id": 37,
    "title": "Walgreens Mail Service",
    "content": "For your ongoing medications, you can have your prescriptions filled through Walgreens Mail Service. Register for mail order through Walgreens Mail Service at www.walgreensmailservice.com or by calling the Walgreens Mail Service call center, available 24/7, at 1.877.787.3047."
  },
  {
    "id": 38,
    "title": "Walgreens Specialty Pharmacy",
    "content": "Walgreens offers a specialty pharmacy program designed for chronic, life-threatening or rare conditions. Specialty drugs are characterized as expensive medications with limited access, complicated treatment regimens, special storage requirements and/or manufacturer reporting requirements.\nIf you take specialty medications, you can have up to a 30-day supply of medications filled through Walgreens Specialty Pharmacy or through a Walgreens retail pharmacy. The program provides educational support, side-effect management, and access to on-staff pharmacists and nurses. For more information, or to fill a prescription for specialty medications, contact Walgreens Specialty Pharmacy at www.walgreensspecialtyrx.com/ or call 1.800.516.9180."
  },
  {
    "id": 39,
    "title": "Step therapy, prior authorization and formulary coverage",
    "content": "There are certain conditions that require step therapy and prior authorization for medications. To avoid delays, check whether your medication requires prior authorization or a step therapy plan, and if it is covered under the plan before getting your prescription filled. For more information about your specific medication, call OptumRx Member Services at 1.855.376.3214 or visit www.optumrx.com.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE\n16"
  },
  {
    "id": 40,
    "title": "Consider all your options",
    "content": "Before you choose a medical plan, it's critical that you do your research:\n· Ensure your home address is up to date. Find the link on W Connect or on StoreNet > Tools > Applications > People Central.\n· Verify that your providers participate in the network for each option by using the Provider Search tool when you enroll for coverage on the Benefits Support Center.\n· Confirm the network hospitals and facilities in your area.\n· Keep in mind: If you are enrolling in a UHC network that requires you to designate a primary care physician (PCP) for yourself and your covered family members, you'll be prompted to do so when you enroll. If you need to change your PCP after you enroll, you'll need to contact UHC directly. In UHC markets where there is tiering, Tier 2 providers will cost you more.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 17"
  },
  {
    "id": 41,
    "title": "How the annual deductible works",
    "content": "Each family member enrolled in one of the Copay medical options has an individual deductible and out-of-pocket maximum.\nUnder the HSA Plan, your family's combined healthcare costs are used to meet one deductible and one out-of-pocket maximum. For example, if you have family coverage under the HSA Plan option and you incur $2,000 in eligible expenses, the plan would not pay benefits until the entire $4,000 family deductible has been met.\nIn the BCBSIL myVirtualCare Access Plan, your individual (or your family's combined) medical costs are used to meet either a Tier 1 or Tier 2 plan deductible. However, many common services (e.g., PCP visits, mental health counseling and specialist visits, among others) are at no or low cost and not subject to the deductible.\nTIP > If you choose the HSA Plan option, you're eligible to contribute to a Health Savings Account. See the Spending and savings accounts section for details."
  },
  {
    "id": 42,
    "title": "Medical carriers",
    "content": "Walgreens continually reviews medical coverage offerings to make sure all team members have access to a medical insurance carrier and provider networks that provide the best value and quality of care. There are a few markets where Walgreens offers a choice of carriers. The BCBSIL myVirtualCare Access Plan is available in all markets. You'll see the designated carriers for your area when you enroll."
  },
  {
    "id": 43,
    "title": "ID cards",
    "content": "In general, most Walgreens medical plan participants will receive one ID card for both medical and prescription drug coverage. If you enroll in the BCBSIL myVirtualCare Access option, you will receive an ID card from Teladoc. Also, UHC may issue new ID cards for team members in the NexusACO® network in certain markets.\n+"
  },
  {
    "id": 44,
    "title": "Carrier networks",
    "content": "Your medical carrier is one part of the equation. The other part is the type of network that's offered by the carrier.\n. All team members have access to a Broad Network that offers more provider choice but may have higher per-paycheck costs.\n. Lower-cost Value Networks (with a smaller number of providers) are available in many areas too.\nEach Broad and Value Network has its own providers, even if they are offered through the same medical carrier.\nIn the BCBSIL myVirtualCare Access medical option, you receive care virtually first. Your Teladoc PCP will refer you to a Walgreens Health partner (or a BCBSIL Network provider when needed) to help you receive Tier 1 benefits. You can also seek care from providers in the BCBSIL Network without a referral at a higher out-of-pocket cost under Tier 2 benefits."
  },
  {
    "id": 45,
    "title": "If your carrier is Blue Cross Blue Shield of Illinois (BCBSIL)",
    "content": "Whether you choose a Broad Network or a Value Network, you'll get the most value when you visit network providers with the BCBSIL Blue Distinction® designation. In the BCBSIL myVirtualCare Access option, your Teladoc PCP will refer you to in-person providers in the BCBSIL Network or VillageMD-part of Walgreens U.S. Healthcare segment-to help ensure you receive Tier 1 benefits.\nYou can also tap into BCBSIL Blue Distinction Centers of Excellence (COEs) (BDC and BDC+) if you need more complex care. These COEs are required for cardiac and transplant procedures through BCBSIL.\nPAGELAST VIEWED\ncontinued\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE\n18"
  },
  {
    "id": 46,
    "title": "If your carrier is UnitedHealthcare (UHC)",
    "content": "Two of UnitedHealthcare's Value Networks-the NexusACO® and Navigate networks-require you to select and get referrals for most services from a primary care physician (PCP).\nThe NexusACO® network also features provider tiering. If you don't use top-rated or specialty Tier 1 providers, you'll pay more for your coverage (40% or 50% after the deductible plus copays for some services, instead of 20%).\nUnitedHealthcare also offers Centers of Excellence (COEs) for specific conditions. You are required to use their COEs for cancer, transplant, fertility and congenital heart disease procedures."
  },
  {
    "id": 47,
    "title": "If your carrier is Kaiser Permanente or Dean / Prevea360",
    "content": "Visit the carrier's website for details about the provider network and any special requirements."
  },
  {
    "id": 48,
    "title": "Did you know?",
    "content": "$5 per clinic visit\nMost Walgreens medical plans include a $5 copay for Walgreens in-store clinic visits. If you have an HSA and haven't yet met the annual deductible for your plan, you may be charged the full cost at time of service. Depending on the clinic, you may be charged the $5 copay and then billed later for the remaining cost."
  },
  {
    "id": 49,
    "title": "Centers of Excellence (COEs)",
    "content": "Both BCBSIL and UHC require you to use their COEs for specific procedures, which are noted on the previous page. Walgreens also offers a separate Carrum Health Medical and Surgery Benefit that offers access to Centers of Excellence for other types of procedures.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 19"
  },
  {
    "id": 50,
    "title": "Tobacco user status",
    "content": "The online enrollment system defaults you to a tobacco user status of \"YES.\" This default affects what you'll pay for medical, voluntary life insurance and critical illness coverage (if applicable). If you and/ or your spouse/domestic partner aren't tobacco users (see definition to the right), you'll need to change your tobacco user status to \"NO\" for yourself and your spouse/domestic partner when you first enroll. Team members with a \"YES\" status will pay up to $1,500 more for medical coverage:\n· $750 per year for a team member who uses tobacco, PLUS\n· $750 per year for a spouse/domestic partner who uses tobacco.\nYou'll also pay higher tobacco user rates for your voluntary life insurance and critical illness coverage.\nIf you and your spouse/domestic partner are tobacco users, you can have the medical plan surcharge removed by completing the free 365 Get Healthy Here Tobacco-Free Program. Visit the Benefits Support Center to learn more."
  },
  {
    "id": 51,
    "title": "Definition of tobacco user",
    "content": "Have you and/or your spouse/domestic partner (if applicable) used tobacco/nicotine products (cigarettes, cigars, chewing tobacco, snuff or electronic nicotine delivery systems such as e-cigarettes, vaping devices, vape pens) within the last three months (regardless of frequency)?\nIf yes, you (and/or your spouse/domestic partner) are considered tobacco users, no matter how often you've used these products. Your tobacco user status should remain \"YES\" for the medical plan and any voluntary life insurance or critical illness coverage you elect. Be sure to read and answer the tobacco user status questions carefully.\nNote: For critical illness coverage, you (and/or your spouse/domestic partner, if applicable) are considered a tobacco user if you've used any of the products listed above within the past 12 months. For purposes of this coverage only, e-cigarette and marijuana users are considered non-tobacco users. The use of marijuana must be legal in the participant's state of residence and prescribed by a physician, or there is the possibility of a covered condition caused or contributed to by the use of marijuana may not be paid, due to the voluntary drug use exclusion."
  },
  {
    "id": 52,
    "title": "Your medical, dental and vision costs",
    "content": "To see what you'll pay for medical, dental and vision coverage and care, get your 2025 estimated costs. (Access code: Stnd2025%#)\nView your 2635 estimated\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 20"
  },
  {
    "id": 53,
    "title": "Get help when you need it through your medical carrier's Care Coordination program",
    "content": "If you choose a Copay or HSA medical plan option through BCBSIL or UHC, your carrier's Care Coordination program offers help through a:\n· BCBSIL Health Advocate; or\n· UHC Care Coordinator.\nThese Care Coordinators/Health Advocates are your trusted advisors who can help you find lower-cost, high-quality network care and help you make the best choices when seeking care-from helping you find a new doctor to getting a second opinion on surgery. Providers can typically perform a procedure at different facilities that all have a different negotiated facility rate-so it's definitely worthwhile to research all available options.\nYour Care Coordinators/Health Advocates can help weigh the pros and cons of treatment options-whether for complex care, the emergency room, urgent care, doctor's office or telemedicine. They can also help you manage a health condition or prepare for surgery by connecting you to resources and support available at no additional cost as part of your benefits. Call the number on the back of your medical ID card to connect to a Care Coordinator/Health Advocate."
  },
  {
    "id": 54,
    "title": "Note to enrollees in UHC options",
    "content": "If you enroll in a UHC option that requires you to coordinate care through your PCP, the PCP will be your first point of contact. You can also work with Care Coordinators if eligible, but if your plan requires it, always start with your PCP."
  },
  {
    "id": 55,
    "title": "Note to enrollees in the BCBSIL myVirtualCare Access Plan option",
    "content": "If you are enrolled in the BCBSIL myVirtualCare Access Plan option, you will coordinate your care through your Teladoc virtual PCP."
  },
  {
    "id": 56,
    "title": "Easy access to your Care Coordinator/Health Advocate",
    "content": "Log on to the Benefits Support Center and click on the Care Coordination Services tile to learn more.\nWhom to Contact\nContact Information\nSupport Provided\nBCBSIL Health Advocate (Copay or HSA)\n1.800.247.9207\n· Care coordination program · Centers of Excellence · Clinical advocacy support, · Narrow network guidelines including targeted support for specific conditions · Claim appeals · Bill review · ID card requests · Claim status · Pre-authorization or predetermination of benefits\nUHC Care Coordinator (Copay or HSA)\n1.844.859.5007\nBCBSIL\n1.855.453.4747 www.luminarehealth.com/walgreens/myvc Virtual PCP (select on the Blue Element Mobile IL mobile app or at myBlueElementIL.com)\nContact your Teladoc virtual PCP to coordinate your care\nmyVirtualCare Access: Blue Cross Blue Shield of Illinois/Teladoc\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 21"
  },
  {
    "id": 57,
    "title": "Specialized care programs",
    "content": "If you're enrolled in a Copay or HSA medical option through BCBSIL or UHC, you have access to the Carrum Health Medical and Surgery Benefit (\"Carrum Health\"), Hinge Health and Vida Health. If you are enrolled in the BCBSIL myVirtualCare Access option, you're eligible for Carrum Health and Hinge Health. These innovative programs can help you get better care and added value."
  },
  {
    "id": 58,
    "title": "Carrum Health Medical and Surgery Benefit",
    "content": "Subject to limited exceptions, you are required to go through Carrum Health when you need one of the procedures listed below. Your surgery will not be covered by the Plan if you get one of these surgeries outside of Carrum Health:\n· Hip and knee replacement\n· Spinal fusion surgery\n· Bariatric (weight loss) surgery\nYou can choose to use the Carrum Health Medical and Surgery Benefit for other procedures, including:\n· Other orthopedic procedures (e.g., hand, wrist, elbow, shoulder, ankle, foot)\n· Cardiac (heart) surgery\n· Breast and thyroid cancer\n· Remote diagnosis, treatment planning and care guidance for all forms of cancer\nThis benefit gives you access to the providers who are ranked in the top 10% nationally. Walgreens covers all or most of the procedure and travel costs (including costs for a travel companion over age 18), so you won't worry about traditional health insurance or surprise bills.\nPlus, it provides 100% coverage for eligible expenses-including travel for yourself and your designated travel partner (must be over age 18). Note: The 100% coverage applies after the deductible if you enroll in the HSA Plan option.\nIf your carrier has a COE in place for a procedure not covered by the Carrum Health Medical and Surgery Benefit, you must use that COE. For example, UHC requires COEs for cancer, transplant and fertility procedures, as well as congenital heart disease.\nCarrum Health also includes access to Carrum's Guidance Program for cancer diagnoses. This program gives you access to:\n· A virtual expert second opinion and personalized treatment plan development\n. An oncology-specialized nurse at a Carrum Center of Excellence\n· A dedicated Carrum care team specialist, who will help coordinate your care\nVisit Carrum.me/Walgreens or call 1.888.855.7806 for support. You'll also find more information and details in the Carrum SPD Insert posted on the Resource Library page of the Benefits Support Center.\nNote: The Carrum Health Medical and Surgery Benefit is a special benefit for employees, dependents and COBRA participants enrolled in any of the UHC or BCBSIL medical plans, including BCBSIL myVirtualCare Access. Your deductible, copay and coinsurance are fully waived except if you're enrolled in the HSA Plan option. Per IRS regulations, HSA enrollees must pay the federal minimum deductible before additional costs are waived. Travel coverage varies based on the procedure. Per IRS rules, a portion of the covered travel expenses will be reported as taxable income.\n8"
  },
  {
    "id": 59,
    "title": "Cancer advocacy programs",
    "content": "Learn about cancer advocacy programs that are included in our health plans to offer specialized education and support resources.\nPAGELAST VIEWED\ncontinued\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 22"
  },
  {
    "id": 60,
    "title": "Hinge Health",
    "content": "Your Walgreens medical coverage through BCBSIL and UHC, as well as the BCBSIL myVirtualCare Access option, also includes access to Hinge Health.\nHinge Health goes above and beyond traditional physical therapy to help you take control of back, knee, joint and pelvic pain. Hinge Health offers enhanced services for acute pain, pain prevention, pre-/post-surgical rehab via Carrum Health and expert medical opinions.\nYour access may include:\n· App-guided exercise therapy-15-minute sessions to reduce pain and increase strength and mobility\n· Wearable sensors-that give you live feedback on your form in the Hinge Health app\n· Personal care team-Connect with your personal health coach or physical therapist at any time\nThanks to a convenient app, your Hinge Health care plan can be done from anywhere and at a time that works best for your schedule. That means never rushing to an appointment or worrying about copays!\nIf you have any questions about the Hinge Health program, call 1.855.902.2777 or visit www.hingehealth.com/walgreens.\nNote: FREE for Walgreens team members and their eligible family members age 18+ who are enrolled in a Copay or HSA medical plan option through BCBSIL or UHC or the BCBSIL myVirtualCare Access option under the Walgreens Health Plan (the \"Plan\")."
  },
  {
    "id": 61,
    "title": "Vida Health",
    "content": "Available at no cost to you, Vida Health matches you to a health coach with proven success in helping people manage chronic conditions (diabetes, high blood pressure), lose weight, improve nutrition and make the kinds of lifestyle changes that lead to happier, healthier lives.\nWhether you want to focus on nutrition, weight loss, stress management, sleep or simply building healthy routines one day at a time, your coach will develop a personal plan and guide you every step of the way.\nYou can sync devices-like fitness trackers, scales and blood sugar meters-to monitor your progress through Vida's easy-to-use mobile app.\nTo enroll, download the Vida Health app to your phone by going to www.vida.com/walgreens or directly to the app store. If you need additional support, you can email support@vida.com or call 1.855.442.5885.\nNote: FREE for Walgreens team members and eligible family members 18+ who are enrolled in a Copay or HSA medical plan option through BCBSIL or UHC option under the Walgreens Health Plan (the \"Plan\"). These programs are designed to benefit those individuals who have been diagnosed with certain chronic conditions (such as obesity, diabetes, pre-diabetes, high blood pressure, high cholesterol, anxiety and depression).\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 23"
  },
  {
    "id": 62,
    "title": "Telehealth",
    "content": "For minor health conditions or referrals, team members have access to care from licensed providers through the telehealth vendor associated with their medical carrier (BCBSIL or UHC). Your cost for telehealth services will vary as shown in the table.\nNote: This section covers telehealth services provided to enrollees in the Copay or HSA Plan.\nTo start a telehealth session on your mobile device, computer or phone, visit your carrier's website (see table), register for an account and follow the prompts.\nIf you have:\n· Chosen BCBSIL myVirtualCare Access as your medical option: Start by contacting your Teladoc PCP.\n· Chosen an HSA Plan or Copay Plan option with BCBSIL or UHC as your medical carrier: Download the \"98point6\" app to your device from the Apple Store or Google Play."
  },
  {
    "id": 63,
    "title": "Important:",
    "content": "· Telehealth services aren't available in all states. Contact your medical carrier to learn about any applicable restrictions.\n. In the rare case that your condition is not suitable for a telehealth visit, you will be referred to a provider to make an in-office appointment. Please confirm with your Care Coordinator or Teladoc PCP that the provider's services will be covered in-network by your medical plan.\n. Some telehealth vendors offer options for behavioral health services. Contact your medical carrier or your telehealth vendor for more information .*\n* Receive up to five FREE mental health counseling visits through Life365, and up to five additional FREE visits for every new issue. To learn more, call Life365 24/7 at 1.855.777.0078 or visit online at walgreenslife365.com, GROUP CODE: life365."
  },
  {
    "id": 64,
    "title": "How does a telehealth visit differ from a virtual visit with a network provider or doctor?",
    "content": "Your network provider or doctor you see regularly may offer \"virtual visits\" over the phone, online or through video chat, instead of an in-office visit. These virtual visits will be covered under the regular plan benefit.\nYour telehealth vendor provides care virtually too, but separately from your network provider or doctor you see regularly. See the table for cost and contact information.\nMedical Carrier\nTelehealth Vendor\nCost\nWebsite\nBCBSIL myVirtualCare Access option\nBlue Cross Blue Shield (BCBSIL)\nTeladoc Virtual PCP\n$0 copay\nwww.luminarehealth. com/walgreens/myvc\nCopay or HSA medical options\nBlue Cross Blue Shield (BCBSIL)\nVirtual Visits by 98point6\n$8 copay\nwww.98point6.com/ walgreens\nUnitedHealthcare (UHC)\nVirtual Visits by 98point6\n$8 copay\nwww.98point6.com/ walgreens\nDean / Prevea360\nDean Health Plan Virtual Visits\nContact Dean for pricing\nwww.deancare.com/ wellness/care- management/virtual-visit\nKaiser Permanente\nMy Doctor Online\nContact Kaiser for pricing\nwww.kp.org/getcare\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 24"
  },
  {
    "id": 65,
    "title": "Supplemental coverage",
    "content": "MetLife is the provider for Group Critical Illness, Group Hospital Indemnity and Group Accident coverages. Consider enrolling in these supplemental benefit options that provide financial protection for your healthcare expenses. You pay the cost of this coverage through convenient payroll deductions, as you do for your other healthcare coverage. Visit www.metlife.com/info/walgreens for more information.\nGroup Critical Illness\nGroup Hospital Indemnity\nGroup Accident\nAbout the Plans\n· Pays a cash lump-sum payment if you are diagnosed with a covered critical illness. · The payment can be used for non-medical expenses that health insurance might not cover. · Benefit election payouts of 25% for autism and skin cancer.\n· Pays a cash benefit that can be used to cover your out-of-pocket expenses in case of a covered hospitalization. . You can use the money toward deductibles, copays, premiums and even to help cover your daily living expenses.\n· Pays cash benefits that correspond with hospital confinements due to a covered accident. · The cash benefits can be used to help pay for deductibles, treatment, house payments and more. Note: This coverage is offered in addition to the company's AD&D coverage. That coverage pays a lump-sum benefit to you or your designated beneficiaries if you die or become seriously injured in an accident.\nFor more information about benefit payout amounts, view plan details at www.metlife.com/info/walgreens.\nThis product is HSA-compatible, so it works well with the HSA medical option, as well as the Copay medical options, to close gaps in coverage. Note: Benefits aren't paid for emergency room treatment or outpatient procedures. IMPORTANT: Refer to the MetLife Group Hospital Indemnity legal disclosure, available in the Resource Library on the Benefits Support Center website.\nNote: If you live in California, your coverage levels may be different than what is shown. It depends on the coverage level you choose. For more information, visit the Benefits Support Center to review your coverage options.\nMetLife is the marketing name used by Metropolitan Life Insurance Company (MLIC) and its affiliates.\nThe supplemental coverage through MetLife is being communicated to you for informational purposes only. The benefit is not sponsored by Walgreens, is not intended to be covered by ERISA, and its inclusion in the materials should not be construed as an endorsement of the product.\nThe coverage is provided under forms GVCIP4, GVSP2 and GVAP6, or state variations thereof. The coverage has exclusions and limitations. Contact your benefits representative for full details.\nThe above benefit(s) may not apply (or may apply differently) to certain union and other team members based on applicable agreements.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 25"
  },
  {
    "id": 66,
    "title": "Health Savings Accounts (HSAs)",
    "content": "To give you more flexibility to save for short- and long-term medical costs, you have access to a high-deductible health plan (HDHP) option that is compatible with a Health Savings Account (HSA). HSAs have many tax advantages that can help you get more for your healthcare dollars now and in the future."
  },
  {
    "id": 67,
    "title": "HSAs provide a triple tax advantage",
    "content": "· Contributions are tax-free;\n· Contributions can be invested and enjoy tax-free growth; and\n· Withdrawals used for qualified expenses are tax-free.\nTIP > See the Medical coverage section and the Summaries of Benefits and Coverage (SBCs) on the Benefits Support Center website for details on what you pay before and after you meet the annual deductible."
  },
  {
    "id": 68,
    "title": "Important!",
    "content": "With an HSA Plan, you'll pay the full cost for all nonpreventive services and prescriptions until you meet the individual or full family deductible (for two or more covered dependents). This includes costs for prescription drugs, doctor's office visits, telehealth consultations and visits to Walgreens in-store clinics.\nIf you have funds in your HSA, you can use your HSA debit card to pay these out-of-pocket costs. You can also pay for the services yourself and request a reimbursement-now or in the future."
  },
  {
    "id": 69,
    "title": "Questions about the HSA?",
    "content": "Contact Optum Bank at www.OptumBank.com or 1.866.234.8913. You can also download the Optum Bank mobile app for account management."
  },
  {
    "id": 70,
    "title": "Flexible Spending Accounts (FSAs)",
    "content": "Looking to cut costs on healthcare or dependent care? Flexible Spending Accounts help you save by using pre-tax dollars for eligible expenses. That means you don't pay taxes on the money you contribute or use for these costs. What a great way to get more for your money!"
  },
  {
    "id": 71,
    "title": "For HSA plan participants who elect the Healthcare FSA",
    "content": "If you enroll in the HSA Plan and the Healthcare FSA, your Healthcare FSA will automatically become a Limited Purpose Healthcare FSA until you meet your medical plan deductible. A Limited Purpose Healthcare FSA can only be used for eligible dental and vision expenses. Limited Purpose debit card transactions for medical or prescription drug expenses will be declined, and you will not be reimbursed for those expenses.\nAfter you meet your medical deductible, contact Optum to update your account to a post-deductible Healthcare FSA. Then, you can use the account for medical and prescription drug expenses moving forward."
  },
  {
    "id": 72,
    "title": "Questions about the FSAs?",
    "content": "Contact Optum at www.OptumBank.com or 1.800.243.5543. You can also download the Optum mobile app for account management.\nPAGELAST VIEWED\ncontinued\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 26"
  },
  {
    "id": 73,
    "title": "Maximize your benefits: Comparing HSA, Healthcare FSA and Dependent Care FSA",
    "content": "Feature\nHealth Savings Account (HSA)\nHealthcare Flexible Spending Account (FSA)\nDependent Care Flexible Spending Account (FSA)\n2025 contribution limits\n· Contribute up to $4,300 individual or $8,500 family tax-free. · Plus an additional $1,000 catch-up contribution if age 55 or older.\n· Contribute up to $3,300 tax-free.\n· Contribute up to $5,000 per year (or $850 for highly compensated employees).\nWhat happens to unused funds?\n· Use the money for eligible medical expenses now, or save it for the future, even into retirement. · Unused HSA dollars carry over from year to year. . Bank account that you own and manage. Any contributions belong to you even if you leave the company or retire.\n· For 2025, you have until December 31, 2025 to incur eligible healthcare expenses. Claims must be submitted by March 31 of the year after the claim was incurred. · You can carry over up to $660 of your unused balance from 2025 to 2026, but you must re-enroll in the healthcare FSA to be eligible. If you don't re-enroll, any carryover balance from 2025 will be forfeited March 31, 2026.\n· Unused funds don't carry over from year to year, so plan carefully. · Claims must be submitted by March 31 of the year after the claim was incurred.\nYou can use it for\nQualified medical expenses, such as: · Doctor's office visits · Dental care · Vision care · Prescription medications · Chiropractic services · Acupuncture · Hearing aids and batteries · Contact lenses/eyeglasses For a full list of qualified medical expenses, visit irs.gov.\nDesigned for health, prescription drug, dental and vision out-of-pocket expenses, such as: · Doctor's office visits · Dental care · Vision care · Prescription medications · Chiropractic services · Acupuncture · Hearing aids and batteries · Contact lenses/eyeglasses For a full list of qualified medical expenses, visit irs.gov. Note: If you choose the HSA medical plan, only a Limited Purpose Healthcare FSA is available for dental and vision expenses until you meet your medical plan deductible.\nDesigned for expenses related to care of a child or dependent adult so you (and your spouse, if married) can work or attend school full-time. Eligible expenses include: · General child care · Before- and after-school care · Summer day camp · Elder care Find a complete list of eligible dependent care expenses at irs.gov/publications/p503.\ncontinued\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL HEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 27\nFeature\nHealth Savings Account (HSA)\nHealthcare Flexible Spending Account (FSA)\nDependent Care Flexible Spending Account (FSA)\nOther details\n· Must enroll in the HSA plan. · You can change your HSA election throughout the year. · Funding your HSA with automatic payroll deductions lowers your taxable income. . As your HSA balance grows, any interest you earn is also tax-free. . You'll receive an HSA debit card from Optum Bank that makes it easy to access your account. . You can only use funds from your HSA after they've been deposited into your account. · To be eligible for the HSA, you can't be covered by Medicaid, Medicare or another non-HDHP medical plan. · While domestic partners are eligible for coverage under an HSA option, HSA reimbursements for their out-of-pocket medical costs aren't considered eligible medical expenses (per the IRS) and will be taxed.\n· The total amount you choose to contribute for the year is taken out of your paycheck over time, but you get the full amount for use as soon as your coverage takes effect. . You can't change your Healthcare FSA election mid-year unless you experience a qualifying life event.\n· The total amount you choose to contribute for the year is taken out of your paycheck over time; you can only request reimbursements for up to the amount you've already contributed for the year. · It's a good idea to speak with a tax professional to determine if the Dependent Care FSA or the federal tax credit provides you with the greatest savings.\nThe above benefit(s) may not apply (or may apply differently) to certain union and other team members based on applicable agreements.\nPAGELAST VIEWED\nBENEFITS AT A GLANCE 28\nCONTACTS\nAND MORE\nFINANCIAL WELL-BEING\nWELL-BEING\nLIFE & DISABILITY\nHEALTH & INSURANCE\nENROLLMENT CENTRAL\nW"
  },
  {
    "id": 74,
    "title": "Commuter Benefit Plan",
    "content": "The Commuter Benefit Plan lets you set aside money on a pre-tax basis to pay the cost of parking and/or using public transportation or vanpool to and from work. By using pre-tax funds, you can lower your taxable income and save on your daily commute! This is a month-to-month benefit that you can enroll in at any time.\nHere's an example of how the plan works: You must enroll from the 4th of one month to the 3rd of the next month, for the following benefit month. For example, for the March 2025 benefit month, you may enroll from January 4 to February 3, 2025.\nCommuter Benefit Plan\nHow it works\n· Set aside money on a pre-tax basis to pay the cost of parking and/or using public transportation or vanpool to and from work. · You save money on taxes, because deductions are taken from your paycheck before taxes are calculated.\n. You can enroll or make changes to your Commuter Benefit Plan elections at any time, not just during Open Enrollment. . You can enroll from the 4th of one month to the 3rd of the next month, for the following benefit month.\nUse it or lose it\nUnused funds will be forfeited when you leave the company.\nYou can use it for\nWork-related transportation costs for: · Parking · Ferry · Train · Trolley · Bus · Vanpool · Subway"
  },
  {
    "id": 75,
    "title": "Questions?",
    "content": "Contact Optum at www.OptumBank.com or 1.877.462.5039. You can also download the Optum mobile app for account management.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 29"
  },
  {
    "id": 76,
    "title": "Dental coverage",
    "content": "Walgreens offers dental plan options through UnitedHealthcare.\nValue PPO Dental\nPremier PPO Dental\nExclusive Network Dental Plan (ENDP)\nAnnual Deductible (individual/family)\n$75 per person up to $225 annual maximum\n$25 per person up to $75 annual maximum\nNone\nAnnual Maximum\n$1,000 per person\n$2,500 per person\nNone\nPreventive Services\n100%, no deductible\n100%, no deductible\n100%\nBasic Services\nYou pay 20% after deductible\nYou pay 20% after deductible\nCopay varies by service\nRestorative Care\nMinor: You pay 20% after deductible Major: You pay 50% after deductible\nYou pay 20% after deductible\nCopay varies by service\nOrthodontia\nNot covered\n50% up to $2,500 lifetime maximum per person (adult and children)\nCopay of $1,850-$1,950\nThis table is intended to give you a snapshot of benefits provided across coverage levels. For more coverage information, visit the Benefits Support Center website or call UHC directly.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL HEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 30"
  },
  {
    "id": 77,
    "title": "Vision coverage",
    "content": "Walgreens offers vision plan options through EyeMed.\nValue Vision\nPremier Vision\nType of Plan\nPPO Plan that covers both in- and out-of-network benefits\nPPO Plan that covers both in- and out-of-network benefits\nPay now or pay later?\nLower paycheck contributions, higher copays and coinsurance\nHigher paycheck contributions, lower copays and coinsurance\nRoutine Vision Exam (once per plan year)\n$20 copay; 20% discount on the amount over the $130 allowance\n$10 copay; 20% discount on the amount over the $200 allowance\nFrames (once per plan year)\n$0 copay; 20% discount on the amount over the $130 allowance\n$0 copay; 20% discount on the amount over the $200 allowance\nLenses (once per plan year; premium lenses may cost more)\nSingle Vision\n$20 copay\n$10 copay\nBifocal\n$20 copay\n$10 copay\nTrifocal\n$20 copay\n$10 copay\nLenticular\n$20 copay\n$10 copay\nProgressive Standard\n$20 copay\n$10 copay\nProgressive Premium Tier 1\n$50 copay\n$40 copay\nProgressive Premium Tier 2\n$60 copay\n$50 copay\nProgressive Premium Tier 3\n$75 copay\n$65 copay\nProgressive Premium Tier 4\n$235 copay\n$225 copay\nContact Lenses (contact lens allowance includes materials only)\nConventional\n$0 copay; 15% discount on the amount over the $130 allowance\n$0 copay; 20% discount on the amount over the $200 allowance\nDisposable\n$0 copay; member pays full amount over the $130 allowance\n$0 copay; member pays full amount over the $200 allowance\nMedically Necessary\n$0 copay; paid in full\n$0 copay; paid in full\nLens Options\nAnti Reflective Coating\n$45-$100 copay\n$45-$100 copay\nPolycarbonate (under 19 years of age)\n$0 copay\n$0 copay\nPolycarbonate (19 years and over)\nNot covered\n$15 copay\nThis table is intended to give you a snapshot of in-network benefits provided across the two plans. For more coverage information, including out-of-network reimbursements and other plan details, visit the Benefits Support Center website or call EyeMed directly.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE\n31"
  },
  {
    "id": 78,
    "title": "Life and disability insurance",
    "content": "Walgreens provides life insurance and disability protection to eligible full-time team members. Any company-paid coverage from Walgreens is automatic. You don't need to enroll to be covered. However, you do need to enroll to receive voluntary coverage.\nRemember to record your beneficiaries on the Benefits Support Center website. Your beneficiaries are the people who receive your life insurance benefit in the event of your death. It's very important to get this information into the system and keep it up to date over time.\nPAGE LAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 32"
  },
  {
    "id": 79,
    "title": "Life and AD&D insurance",
    "content": "MetLife is the carrier for your Company-Paid and Voluntary Life and Accidental Death & Dismemberment (AD&D) coverage. If you are eligible, you automatically receive company-paid coverage and you have the option to enroll in additional voluntary coverage. You pay the cost of this coverage through convenient payroll deductions, as you do for your other healthcare coverage."
  },
  {
    "id": 80,
    "title": "Eligibility",
    "content": "You're eligible for both the company-paid and voluntary life and AD&D insurance if you are a:\n· Full-time salaried team member, actively working at least 30 hours per week for 30 days\n· Full-time hourly team member, actively working at least 30 hours per week for at least 90 days"
  },
  {
    "id": 81,
    "title": "Reminder!",
    "content": "Confirm your beneficiary(ies) on the Benefits Support Center website. You'll need to provide your beneficiary's name, address, Social Security number and birthdate."
  },
  {
    "id": 82,
    "title": "Company-Paid Life",
    "content": "If you meet the Plan's eligibility requirements, you are automatically enrolled in coverage for a life insurance benefit equal to:\n. 1.5 times annual base salary for all salaried team members and any eligible hourly team members\n· $25,000 for all other hourly team members\nNote: If your employment is covered by a collective bargaining agreement, you may be eligible for a different company-paid Life or Accidental Death & Dismemberment (AD&D) benefit. Visit the Benefits Support Center to confirm your coverage amounts.\nIf you're a salaried team member and your life insurance coverage is over $50,000, you'll pay income tax on the amount over $50,000 (due to IRS regulations).\nThe above benefit(s) may not apply (or may apply differently) to certain union and other team members based on applicable agreements.\nPAGELAST VIEWED\ncontinued\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 33"
  },
  {
    "id": 83,
    "title": "Voluntary Life and AD&D Insurance",
    "content": "Benefits-eligible hourly and salaried team members also have the opportunity to buy up to a higher level of coverage through voluntary life insurance."
  },
  {
    "id": 84,
    "title": "You",
    "content": ". Elect up to 10 times annual base salary in increments of $10,000 up to $500,000 Guaranteed Issue without Evidence of Insurability (EOI).\n· The total of your company-paid and voluntary coverage combined can't exceed $12 million."
  },
  {
    "id": 85,
    "title": "Spouse/Domestic Partner",
    "content": "· Elect up to $750,000 in coverage or the dollar amount of your combined company-paid and voluntary coverage-whichever is less-in increments of $1,000 up to $40,000 Guaranteed Issue without Evidence of Insurability (EOI)."
  },
  {
    "id": 86,
    "title": "Dependent Children",
    "content": "· You can elect up to $25,000 in coverage in $5,000 increments. Evidence of Insurability is not required.\nYou can enroll in voluntary life insurance coverage, for you and your family, at any time during the year. You can enroll in voluntary life insurance via the Benefits Support Center. However, Evidence of Insurability (EOI) rules will apply for any elections or increases at any time other than when you are first eligible.\nNote: Coverage rates are based on whether you and/or your covered spouse/ domestic partner (if applicable) use tobacco products. When you enroll, you'll need to certify your tobacco user status to receive non-tobacco user rates. If you and your spouse/domestic partner have used tobacco/nicotine products (cigarettes, cigars, chewing tobacco, snuff or electronic delivery systems such as e-cigarettes, vaping devices or vape pens) within the last three months, you're considered a tobacco user, regardless of how often you've used these products."
  },
  {
    "id": 87,
    "title": "Whole Life Insurance + Long-Term Care (LTC) Plan*",
    "content": "Walgreens offers a new type of financial protection benefit: A Whole Life Insurance benefit that includes a Long-Term Care (LTC) rider. The policy includes three parts-Whole Life Insurance, a Long-Term Care rider and it builds cash you can draw from if needed.\nWhole Life insurance provides lifelong coverage and a cash value component, while the LTC rider adds protection against the potentially high costs of long-term care. You and your spouse/ domestic partner can choose whether to enroll based on your needs.\nThis voluntary benefit allows you to gain confidence in knowing that you have a plan in place to address your future life insurance needs and potential long-term care expenses. If needed, either the Life or the Long-Term Care benefit can be utilized without depleting the value of the other benefit.\nYou have a special opportunity to elect this coverage with a guaranteed rate lock for the life of your coverage. The younger you are when you enroll, the lower your rates will be for the life of your coverage! You can only enroll when you are newly eligible or during Open Enrollment each year. You cannot increase your coverage during the year, but you can drop coverage. You may also choose coverage for your spouse or domestic partner if you enroll in coverage for yourself. If you get married during the year, which is a qualifying life event, you may elect coverage for your new spouse, but only if you are currently enrolled in team member only coverage.\n* Accelerated death benefit with restoration and extension of benefits. This is a voluntary benefit, and you can choose whether to enroll based on your needs.\nThe Whole Life Insurance + LTC through Allstate is being communicated to you for informational purposes only. The benefit is not sponsored by Walgreens, is not intended to be covered by ERISA and its inclusion in the materials should not be construed as an endorsement of the product.\nThe above benefit(s) may not apply (or may apply differently) to certain union and other team members based on applicable agreements.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 34"
  },
  {
    "id": 88,
    "title": "Disability coverage",
    "content": "Walgreens disability plans protect your paycheck if you are unable to work due to a covered illness, injury or pregnancy. Refer to the Summary Plan Description (SPD) posted on the Benefits Support Center for details about the eligibility requirements and when coverage is effective.\nIf eligible, your company-paid coverage from Walgreens is automatic. You don't need to enroll to be covered. However, you do need to enroll to be covered for the voluntary disability plan. You can enroll in that plan by logging on to the Benefits Support Center. Once enrolled, you may cancel or change coverage at any time .*"
  },
  {
    "id": 89,
    "title": "For hourly team members",
    "content": "· Seven-calendar-day waiting period.\n· Up to six weeks at 100% base pay.\n· Up to six weeks at 50% base pay; 50% benefit may be supplemented by accrued PSSL, PTO, Frozen Sick or Frozen Vacation."
  },
  {
    "id": 90,
    "title": "For salaried team members and limited categories of hourly team members",
    "content": "· Seven-calendar-day waiting period.\n· Up to six weeks at 100% base salary, followed by 50% of base salary for the remainder of your disability, up until you reach \"Social Security Normal Retirement Age,\" depending on the year you were born.\n· 50% benefit may be supplemented by PTO/FTO, Frozen Sick or Frozen Vacation .**\n· Your base salary is your monthly earnings from Walgreens the day before your disability begins. As a general rule, it doesn't include any bonuses, commissions, overtime pay or other special compensation or hours worked over and above your positions base salary.\n· Note: Base salary does include overtime for nighttime pharmacists."
  },
  {
    "id": 91,
    "title": "For hourly team members",
    "content": ". If you enroll in the voluntary disability plan, it will kick in after the Walgreens-paid disability coverage ends.\n· This additional benefit allows you to receive up to 50% of your pay-tax-free-for either a two- or five-year benefit period while you remain disabled."
  },
  {
    "id": 92,
    "title": "For salaried team members and limited categories of hourly team members",
    "content": "· The voluntary disability plan has a 13-week waiting period beginning with the first regularly scheduled workday missed and pays an additional 10%, 15% or 20% of pay-tax-free-in addition to the 50% benefit provided by Walgreens.\n· This benefit is payable as long as you remain disabled, up to the \"Social Security Normal Retirement Age.\"\n* Evidence of Insurability (EOI), or proof of good health satisfactory to Prudential, will be required when you enroll in any amount above Guaranteed Issue and for any increase in coverage elected in the future. Pre-existing condition limitations also apply.\n** If you are eligible for disability benefits, disability-related benefits or retirement- related income from other sources, then your benefits from this plan will be reduced. Refer to the Walgreens Health and Welfare Plan Summary Plan Description for details.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE CONTACTS\nBENEFITS AT A GLANCE\n35"
  },
  {
    "id": 93,
    "title": "Supporting your well-being 24/7",
    "content": "Walgreens offers a comprehensive well-being program that supports your physical and emotional well-being. These programs are generally provided at no cost to you. Keep reading to learn more.\nPAGE LAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 36\nPAGE LAST VIEWED"
  },
  {
    "id": 94,
    "title": "Enrolling in your benefits is just the first step: Making the most of your coverage is a year-round journey",
    "content": "If you enroll in coverage through BCBSIL (including the BCBSIL myVirtualCare Access option) or UHC, you have access to all of these programs. If you choose another Walgreens insurance carrier, you have access to Life365 and the 365 Get Healthy Here Tobacco-Free Program as well as free in-network preventive care."
  },
  {
    "id": 95,
    "title": "Preparing for your care",
    "content": "V Participate in 365 Get Healthy Here (365GHH)\n365 Get Healthy Here provides:\n· $0 Rx Copay Program for those enrolled in a Walgreens medical plan\n· Tobacco-Free Program through Vida Health*\nV Take advantage of this valuable well-being program Free flu shots\nV You can also take advantage of other wellness incentives and programs offered through your insurance carrier\nV Locate a high-quality provider using the Provider Search tool on the Benefits Support Center website*\nIMPORTANT! Using an in-network provider is critical. When you enroll on the Benefits Support Center website, use only the provider search tools to check the network status of your and your family's doctors, hospitals and facilities.\n* The Tobacco-Free Program through Vida Health is not available to post-65 retirees and certain union plans and participants are not eligible for this program.\ncontinued\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 37\n我死"
  },
  {
    "id": 96,
    "title": "V Visit your in-network provider",
    "content": "Get recommended preventive care, including certain cancer screenings, covered at 100% with no deductible.\nLearn about the preventive screenings, health resources and advocacy programs our health plans offer."
  },
  {
    "id": 97,
    "title": "V Tap into the mental health and well-being services and support provided through Life365:",
    "content": "Life365 Employee Assistance Program (EAP) with 24/7 access to professional advisors via telephonic, in-person or video counseling. Up to five free visits with a clinician in your community, per issue."
  },
  {
    "id": 98,
    "title": "V Consult with your UHC PCP (if applicable) or your Teladoc virtual PCP to compare prices and obtain any necessary referrals",
    "content": "Compare prices and choose more cost-effective options and locations for medical treatments such as ultrasounds and MRIs."
  },
  {
    "id": 99,
    "title": "V Contact your health plan's Care Coordinator",
    "content": "Get help with claims, questions about proposed care and other possible options, and information about Centers of Excellence (COEs) and targeted programs for certain medical conditions like diabetes, maternity, cancer and back, knee and other musculoskeletal concerns.\n· BCBSIL myVirtualCare Access option virtual PCP (select on the Blue Element Mobile IL mobile app or at myBlueElementIL.com)\n. BCBSIL Health Advocate (Copay or HSA)\n. UHC Care Coordinator (Copay or HSA)\nPAGE LAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 38"
  },
  {
    "id": 100,
    "title": "365 get healthy here",
    "content": "The 365 Get Healthy Here Wellness Program (365GHH) is the foundation of our wellness offerings and supports team members and their covered spouses/domestic partners in leading healthier lifestyles.\nThe following resources are available 24 hours a day, seven days a week, by visiting the Benefits Support Center:\n· Participants enrolled in a Walgreens medical plan may qualify for the $0 Rx Copay Plan1 for medications for certain chronic conditions by participating in a healthy activity.\n- Eligible conditions include high cholesterol, coronary artery disease, diabetes, high blood pressure (hypertension), asthma and/or weight loss.\n- To learn more about the $0 Rx Copay Program, refer to the $0 Rx Copay Program Rewards Resource on the My HR Experience Portal or call OptumRx at 1.855.376.3214.\n· Get FREE support and resources to help you quit tobacco with Vida Health. To learn more, refer to the Tobacco-Free Program Rewards Resource on 365GHH. Upon completion of the program, team members and their spouses/domestic partners can remove their Walgreens medical plan tobacco surcharge.\n. Access the Life365 Employee Assistance Program (EAP).\n1 Normal HSA rules apply.\nNote: Your personal health information is kept completely private and confidential. In keeping with federal law, your individual health information may be shared only with other entities involved in administering company health benefits that agree to comply with the Health Insurance Portability and Accountability Act (HIPAA) privacy regulations."
  },
  {
    "id": 101,
    "title": "Support for anytime you need it!",
    "content": "Take the first step toward a happier, more balanced life with Life365.\nAdministered by CuraLinc Healthcare, the Walgreens Life365 EAP offers guidance to help you address and resolve everyday issues at no cost to you or your eligible family members .* You can receive support to address family and relationship issues, improve work-life balance, manage stress and anxiety and more.\nLife365 provides guidance through:\n· In-the-moment support with a licensed clinician\n· Short-term counseling sessions in-person or virtual\n· Concierge resources to find referrals for child and elder care, home repair, housing needs and more\n· Mindstream™, a new solution that offers live and on-demand video and audio sessions on a variety of mental well-being topics.\nAccess support whenever it's needed and wherever is most convenient for you. Visit walgreenslife365.com or download the mobile app. Use the group code, life365, to create a personal profile. You can also call 1.855.777.0078 for support 24 hours a day, 7 days a week.\nLife365 ensures no one will know you have accessed the program without your written permission except as required by law.\nNote: Life365 is available more broadly to team members, regardless of health coverage eligibility or participation.\n* Your eligible family members include those living in your home, as well as children living outside of your home up to age 26.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 39"
  },
  {
    "id": 102,
    "title": "Free flu shots",
    "content": "Get your free flu shot at any Walgreens store during all pharmacy and clinic hours, including overnights at 24-hour pharmacy locations, and on weekends and holidays. If you're not already registered in the pharmacy system, the pharmacist or Walgreens in-store clinic nurse practitioner will ask for your employee number to identify you as a Walgreens team member.\nNote: Only team members are eligible for this benefit. Your dependents covered by a Walgreens medical plan can receive a free flu shot under the preventive care benefit."
  },
  {
    "id": 103,
    "title": "Tip >",
    "content": "In addition to participating in these programs, you may have access to programs offered by your insurance carrier. Check your carrier's website for specific details that apply to you."
  },
  {
    "id": 104,
    "title": "The Walgreen Benefit Fund",
    "content": "When team members are faced with financial hardships from tragedies like natural disasters, chronic illnesses, high medical bills or funeral costs, the Walgreen Benefit Fund (WBF) is here to provide support- because at Walgreens, we're committed to standing by you when it matters most. The WBF is a separate 501(c)(3) non-profit entity that was started in the 1930s by Charles R. Walgreen, Sr. as a way to support team members in times of need and continues to be funded primarily by fellow team members.\nFor more information on how to apply for a grant and/or how to donate to this important fund, visit the WBF page on W Connect, or type Walgreen Benefit Fund into the My HR Experience Portal.\nYou are eligible to apply for financial assistance if you:\n· Have at least six months of service;\n· Experience a qualifying life event (long-term illness, serious injury, death of immediate family, unsafe living conditions or natural disaster); and\n· Have exhausted all other assistance sources.\nTo apply, team members complete applications to document their hardship, and the Walgreen Benefit Fund staff will review those applications and approve need-based aid."
  },
  {
    "id": 105,
    "title": "Weight Management discounts through PerkSpot",
    "content": "Visit PerkSpot at https://walgreens.perkspot.com or call 1.866.606.6057 for information about discounts such as Noom, Daily Harvest, Green Chef, Thrive Market, Home Chef, WeightCare and Pressed Juicery.\nCheck back frequently, as discounts may change throughout the year.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL HEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 40"
  },
  {
    "id": 106,
    "title": "Paid time off benefits",
    "content": "Walgreens offers three different Paid Time Off benefit programs under which team members may receive paid time off depending on which program they are eligible for.\n. The Flexible Time Off (FTO) Program applies to team members in or equivalent to Analysis Band and above.\n. The Paid Time Off (PTO) Plan applies to team members who maintain a 12-week average of 30 hours or more.\n. Paid Sick and Safe Leave (PSSL) Program applies to team members who work a 12-week average of less than 30 hours.\nTeam members accrue PTO or PSSL based on their hours worked each week. Team members can use the time accrued for their time off needs after they have satisfied the new hire eligibility period of 90 calendar days from date of hire, unless required otherwise by law. More information can be found on the My HR Experience Portal with details on how much time team members are eligible to accrue based on their position, work location and weekly average hours.\n."
  },
  {
    "id": 107,
    "title": "Holidays",
    "content": "Walgreens observes the following holidays:\n· New Year's Day\n· Labor Day\n· Memorial Day\n· Thanksgiving Day\n· July 4th\n· Christmas Day\nOther holidays may be observed in different parts of the U.S. or at your specific location.\nIf you're an hourly team member and work an average of 20 hours a week, you'll be eligible for company-paid holidays after six months of service. If you're salaried, you're eligible immediately. Information about the Holiday Benefit Program can be found on the My HR Experience Portal."
  },
  {
    "id": 108,
    "title": "Paid Parental Leave (PPL) Program",
    "content": "The PPL Program allows eligible team members to take up to eight weeks of paid leave, at 100% base pay, to bond with their newborn or newly adopted child under the age of 18.\nAvailable to mothers and fathers, biological or adoptive, as well as parents whose baby is carried via a surrogate, this program provides for eight weeks of leave at 100% pay.\nTeam members must meet the eligibility requirements as of the date of the qualifying birth/adoption, and also as of the start of the leave.\nTeam members must average 30 or more hours per week for the most recent 52 weeks (or since their hire date if less than 52 weeks). Other key points:\n· Salaried team members are eligible 91 days after their hire date.\n. Hourly team members are eligible 181 days after their hire date. In cases where both parents are employed by the company, up to eight weeks of paid parental leave is available to each team member.\nFor more information, refer to the Paid Parental Leave Policy available on the My HR Experience Portal.\nThe above benefit(s) may not apply (or may apply differently) to certain union and other team members based on applicable agreements."
  },
  {
    "id": 109,
    "title": "Bereavement Leave",
    "content": "Walgreens recognizes that a death in the family may necessitate time away from work to grieve and attend to family matters. An eligible team member can take Bereavement Leave for the death of a parent, step-parent, parent-in-law, sibling, step-sibling, child, step-child, spouse, domestic partner, son-in-law, daughter-in-law, sister-in-law, brother-in-law, grandparent, step-grandparent, grandchild, step-grandchild or grandparent-in-law.\nBereavement Leave may extend from the day of death up to and including the day of the memorial service, up to a maximum of four days.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE\n41"
  },
  {
    "id": 110,
    "title": "Family forming benefits",
    "content": "Walgreens recognizes that there are many paths to parenthood and provides several benefits and programs for eligible team members who want to grow their families. We are proud to support our team members by offering financial assistance through our Adoption and Surrogacy Reimbursement Program .*\nFertility coverage: The HSA and Copay medical plan options through UnitedHealthcare and Blue Cross Blue Shield of Illinois provide a lifetime maximum benefit of up to $50,000 for fertility treatment. You aren't required to provide a medical diagnosis, and there is no age limit. These medical plan options also provide fertility preservation services for situations beyond the \"medical necessity\" requirement. There is a $15,000 lifetime maximum for fertility drugs. Contact OptumRx for more information about how these drugs are covered.\nAdoption and Surrogacy Reimbursement Program: Walgreens offers the Adoption and Surrogacy Reimbursement Program* that reimburses each eligible team member up to $10,000 per lifetime for eligible expenses related to using a surrogate to assist in carrying and giving birth to a child.\nIt also provides eligible team members with financial assistance of up to a lifetime maximum of $10,000 toward qualified expenses related to an eligible adoption.\nNote: The Adoption and Surrogacy Reimbursement Program is offered separately from the Walgreens medical plans. You don't have to be covered under a Walgreens medical plan option to receive these benefits.\n* To be eligible for the Adoption and Surrogacy Reimbursement Program, you must be a Walgreens or WBA U.S .- based team member who is aligned to Walgreens employee benefit plans and programs. For additional eligibility details, review the Benefit Program Overview on the My HR Experience Portal or the Benefits Support Center.\nThe above benefit(s) may not apply (or may apply differently) to certain union and other team members based on applicable agreements."
  },
  {
    "id": 111,
    "title": "Supporting the needs of our LGBTQ+ community",
    "content": "Learn how Walgreens provides comprehensive coverage for all.\nPAGELAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nAND MORE FINANCIAL WELL-BEING\nCONTACTS\nBENEFITS AT A GLANCE\n42"
  },
  {
    "id": 112,
    "title": "Financial well-being",
    "content": "Whatever your financial focus, Walgreens offers two programs that can help you build long-term savings for your future-the Walgreens Retirement Savings Plan and the Walgreens Student Loan 401(k) Match Program. The company also offers programs that can help you save money right now. Note: These programs are available more broadly to team members, regardless of health coverage eligibility or participation.\nPAGE LAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 43"
  },
  {
    "id": 113,
    "title": "Walgreens Retirement Savings Plan",
    "content": "The Walgreens Retirement Savings Plan-also called a 401(k) Savings Plan-helps you build income for your retirement future. You can enroll in this plan at any time after you are eligible.\nAs a Walgreens team member, you can join the plan if you're 18 years of age or older. You can participate immediately upon hire, with no waiting period. Once you join, you can contribute up to 90% of your pay, up to the annual IRS limit. You choose how to invest your plan account, using any combination of the plan's investment funds.\nYou are generally eligible for company matching contributions after one year plus 1,000 hours of service. After you become match-eligible, the company matches the first 4% of pay you contribute to your account (including pre-tax contributions and Roth 401(k) contributions). Please review the Summary Plan Description for specific eligibility requirements.\nWhen you're first hired by Walgreens, you'll receive enrollment information from Fidelity Investments® at the email address you have on file with Walgreens. If you don't have an email address on file with Walgreens, you'll receive your enrollment information via postal mail at your home address. To enroll in the plan at any time, visit www.netbenefits.com. You may also call the Walgreens Retirement Savings and Investment Center at Fidelity by calling 1.833.422.9247, Monday through Friday from 7:30 a.m. to 7:30 p.m. Central time.\nNote: These programs are available more broadly to team members, regardless of health coverage eligibility or participation."
  },
  {
    "id": 114,
    "title": "Walgreens Student Loan 401(k) Match Program",
    "content": "Walgreens is proud to be among the first large employers to offer a financial well-being program that supports the financial future of our team members with student loan debt.\nWe offer the Walgreens Student Loan 401(k) Match Program because you shouldn't have to choose between paying off student loan debt and saving for retirement.\nThis benefit will help boost your Walgreens Retirement Savings Plan-or RSP. Walgreens treats your monthly student loan payments as if they were 401(k) contributions and matches them up to 4% of your eligible pay. You are generally eligible for company matching contributions after one year and 1,000 hours of service.\nWhen you become eligible for the Walgreens Student Loan 401(k) Match Program, you will receive more information from Fidelity.\nFinancial Well-Being through NetBenefits® ®\nWalgreens has teamed up with Fidelity Investments® to make financial wellness tools available on NetBenefits®, to help you with debt management, tax preparation, managing student debt, budgeting, saving for college, tax preparation, wills and estate planning and more!\nIn under 10 minutes, take the financial wellness checkup by answering a few questions and get a summary of how you're doing financially.\nTIP > Text FIT to 343-898 to get a link to the checkup .*\n* Message and data rates may apply. Get details at https://digital.fidelityinvestments.com/SMSee.\nPAGELAST VIEWED\n44\nBENEFITS AT A GLANCE\nCONTACTS\nAND MORE\nFINANCIAL WELL-BEING\nWELL-BEING\nLIFE & DISABILITY\nHEALTH & INSURANCE\nENROLLMENT CENTRAL\nW"
  },
  {
    "id": 115,
    "title": "EarnIn Financial Service",
    "content": "EarnIn is a financial service designed to provide early access to your earned wages, helping you manage unexpected expenses with greater flexibility. Walgreens team members get a $0.50 discount on all optional Lightning Speed transfers. While EarnIn offers the option to provide a tip to support their service, tipping is not required. Visit www.earnin.com for more details.\nAs part of our review of terms and prevalence of the various third-party advance pay services in the marketplace, Walgreens has decided to partner with EarnIn to communicate and describe the EarnIn offerings to our team members, including early pay access and other services. Walgreens has no financial, administrative or other involvement in these services, which are exclusively between EarnIn and each team member, and are no different than the services offered by EarnIn to the general public. Walgreens is not providing any team member data to EarnIn and assumes no responsibility or liability with respect to EarnIn services. The decision of whether to utilize the services of EarnIn (and/or any other early pay access provider) is strictly yours.\nPAGE LAST VIEWED\nW\nENROLLMENT CENTRAL HEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 45"
  },
  {
    "id": 116,
    "title": "Added Benefits® ®",
    "content": "Use the Added Benefits Program to save money on auto, home and pet insurance. You can also get discounts on group legal coverage and identity theft protection.\nHere's an overview of what's offered."
  },
  {
    "id": 117,
    "title": "Auto and Home Insurance",
    "content": "Take advantage of competitive rates and save money when you insure your auto, home and other property, and yourself against personal liability from leading national carriers through the Added Benefits® Auto and Home Insurance Program."
  },
  {
    "id": 118,
    "title": "LifeLock™ Identity Theft Protection Program",
    "content": "Protect your identity, your devices and your online privacy against online threats, viruses, ransomware and malware, at home and on the go."
  },
  {
    "id": 119,
    "title": "MetLife Legal Plans",
    "content": "Eliminate the stress of finding the right attorney and paying hefty legal fees for life's planned and unplanned legal matters by enrolling in group legal coverage through MetLife.\nYou can only enroll when you're first eligible for coverage or during each year's Open Enrollment period. Call Added Benefits at 1.844.800.8548 or visit www.walgreensaddedbenefits.com.\nThe supplemental coverage through Added Benefits including the MetLife Legal Plans, is being communicated to you for informational purposes only. The benefit is not sponsored by Walgreens, is not intended to be covered by ERISA, and its inclusion in the materials should not be construed as an endorsement of the product. Visit www.walgreensaddedbenefits.com for full plan details and disclaimers.\nThe above benefit(s) may not apply (or may apply differently) to certain union and other team members based on applicable agreements."
  },
  {
    "id": 120,
    "title": "Pet Insurance",
    "content": "Purchase pet insurance at competitive rates through our partnership with Added Benefits®."
  },
  {
    "id": 121,
    "title": "Purchasing Power®",
    "content": "Buy brand-name computers, electronics, appliances and more through the ease of automatic payroll deductions, if eligible. Purchasing Power offers no required up-front cash or credit check and 12 months to pay."
  },
  {
    "id": 122,
    "title": "Eligibility*",
    "content": "If you're a part-time or full-time team member, you're eligible for Auto and Home Insurance, LifeLock Identity Theft Protection Program, MetLife Legal Plans and Pet Insurance. To be eligible for Purchasing Power®, you must be a part-time or full-time team member who has been active for at least 12 months of service and earns at least $16,000 annually. You must also have a bank account or credit card (to be used for direct bill pay or in case of non-payment via payroll deduction).\nPAGELAST VIEWED\nBENEFITS AT A GLANCE 46\nCONTACTS\nAND MORE\nFINANCIAL WELL-BEING\nWELL-BEING\nLIFE & DISABILITY\nHEALTH & INSURANCE\nENROLLMENT CENTRAL\nW"
  },
  {
    "id": 123,
    "title": "Team Member Purchase Discount Program",
    "content": "Walgreens and WBA team members, including Duane Reade team members, and their immediate family members who reside in the same household are eligible for merchandise discounts on purchases made at Walgreens, Duane Reade and Walgreens.com. It provides a discount of up to 25% on Walgreens-owned brands and up to a 15% discount on almost all other merchandise.\nTo receive the team member discount, team members (or their immediate family members) need to link their myWalgreens™ account (maximum two myWalgreens™ accounts) to their team member discount by entering their phone number and zip code associated with their myWalgreens™ account on the keypad during checkout.\nFor additional program details, review the Team Member Purchase Discount Program on the My HR Experience Portal.\nPAGE LAST VIEWED"
  },
  {
    "id": 124,
    "title": "PerkSpot",
    "content": "The PerkSpot discount purchase program offers Walgreens team members savings on goods and services from thousands of national and local retailers and service providers-such as electronics, travel, movie tickets and more. Get more information at https://walgreens.perkspot.com or call 1.866.606.6057."
  },
  {
    "id": 125,
    "title": "Childcare discounts",
    "content": "Walgreens partners with The Learning Care Group, KinderCare Education and The Learning Experience, national early education and child care providers, to offer team members a 10% discount on services. For more information, visit PerkSpot at https://walgreens.perkspot.com or call 1.866.606.6057.\nKinderCare Education includes\nThe Learning Care Group\nthe following providers:\nincludes the following providers:\n· KinderCare\n· Tutor Time\n· Knowledge Beginnings\n· Child Time\n· Champions Before and After\n· Children's Courtyard\nSchool Program\n· Montessori Unlimited\n· LaPetite Academy · Creative Kids"
  },
  {
    "id": 126,
    "title": "Additional caregiver resources through Life365 EAP",
    "content": "Walgreens team members also have access to childcare support and referral resources through Life365, our third-party EAP administrator. To connect with a live EAP Care Advocate, you and your eligible dependents can call Life365 24/7 at 1.855.777.0078 or visit online at walgreenslife365.com, GROUP CODE: life365.\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE\n47"
  },
  {
    "id": 127,
    "title": "Get the big picture",
    "content": "Your pay, paid time off, Retirement Savings Plan, company-paid disability and life insurance, an extensive wellness program and a long list of team member discounts-together with your healthcare coverage- make up the full picture of your employee benefits: in other words, Your Total Rewards.\nTo get the full scoop, click the Your Total Rewards data card on the home page of the Benefits Support Center. Your statement includes up-to-date information about your pay and time off, financial well-being and other rewards and company perks you've just learned about. Select the Your Total Rewards Statement button to see all the details."
  },
  {
    "id": 128,
    "title": "Questions?",
    "content": "Call the Benefits Support Center at 1.855.564.6153. Representatives are available from 8 a.m. to 5 p.m. Central time, Monday through Friday.\nPAGE LAST VIEWED\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 48"
  },
  {
    "id": 129,
    "title": "Contacts",
    "content": "General support\nBenefits Support Center (Alight Solutions)\nwww.BenefitsSupportCenter.com\n1.855.564.6153\n(Representatives are available from 8 a.m. to 5 p.m. Central time, Monday through Friday)\nMedical and prescription drug coverage\nNational carriers\nRegional carriers\nBlue Cross Blue Shield of Illinois\nwww.bcbsil.com/walgreens 1.800.247.9207\nDean / Prevea360\nhttp://aon.deanhealthplan.com 1.877.232.9375\nUnitedHealthcare\nwww.myuhc.com 1.844.859.5007\nKaiser Permanente\nhttp://www.kp.org Pre-enrollment: 1.877.580.6125\nBCBSIL myVirtualCare Access: Blue Cross Blue Shield of Illinois/Teladoc\nwww.luminarehealth.com/walgreens/myvc 1.855.453.4747\nOngoing: CA: 1.800.464.4000 CO: 1.303.338.3800 Mid-Atlantic: 1.800.777.7902 Northwest: 1.800.813.2000 SBC: 1.855.249.5005\nOptumRx (Pharmacy Benefit Manager)\nPre-enrollment: welcome.optumrx.com/walgreens Ongoing: optumrx.com 1.855.376.3214\nWalgreens Mail Service\nwww.walgreensmailservice.com 1.877.787.3047 Call center is available 24/7\nWalgreens Specialty Pharmacy\nwww.walgreensspecialtyrx.com 1.800.516.9180\nDental coverage\nUnitedHealthcare\nwww.myuhc.com 1.866.660.7181\nVision coverage\nEyeMed\nhttps://member.eyemedvisioncare.com/walgreens 1.844.844.0896\nPAGE LAST\nVIEWED\ncontinued\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 49"
  },
  {
    "id": 130,
    "title": "Contacts continued",
    "content": "Specialized care programs\nCarrum Health Medical and Surgery Benefit\nCarrum.me/Walgreens 1.888.855.7806\nHinge Health\nhingehealth.com/walgreens 1.855.902.2777\nVida Health\nwww.vida.com/walgreens 1.855.442.5885\nSpending and savings accounts\nFlexible Spending Accounts\nOptum\nwww.OptumBank.com or download the Optum mobile app\n1.800.243.5543\nCommuter Benefit Plan\nOptum\nwww.OptumBank.com or download the Optum mobile app\n1.877.462.5039\nHealth Savings Account\nOptum Bank\nwww.OptumBank.com or download the Optum Bank mobile app 1.866.234.8913\nFamily forming benefits\nAdoption and Surrogacy Reimbursement Program\nYour Spending Account (through the Benefits\nwww.BenefitsSupportCenter.com 1.855.564.6153\nSupport Center)\nLife, AD&D and supplemental benefits\nLife Insurance, AD&D,\nand Group Accident\nGroup Critical Illness, Group Hospital Indemnity\nMetLife\nwww.metlife.com/info/walgreens 1.833.891.5433 (for policy questions, inquiries and claims) . Life and AD&D Claims: Press 1\n· Statement of Health or Evidence of Insurability: Press 2 . Critical Illness, Hospital Indemnity or Accident Insurance: Press 3"
  },
  {
    "id": 131,
    "title": "Whole Life Insurance + Long-Term Care (LTC)",
    "content": "Allstate Customer\nmybenefits.allstate.com\nCare Center\n1.866.828.8501\nPAGE LAST\nVIEWED\ncontinued\nW\nENROLLMENT CENTRAL\nHEALTH & INSURANCE\nLIFE & DISABILITY\nWELL-BEING\nFINANCIAL WELL-BEING\nAND MORE\nCONTACTS\nBENEFITS AT A GLANCE 50"
  },
  {
    "id": 132,
    "title": "Contacts continued",
    "content": "Other benefit resources\nHigh touch support with healthcare questions\nMedical Carrier's Care Coordination Program\nBCBSIL my VirtualCare Access virtual PCP\nSelect on the Blue Element Mobile IL mobile app or at myBlueElementIL.com\nBCBSIL Health Advocate\n(Copay or HSA option)\n1.800.247.9207\nUHC Care Coordinator (Copay or HSA option)\n1.844.859.5007\nLife365 EAP\nCuraLinc\nwww.walgreenslife365.com GROUP CODE: life365 1.855.777.0078\nOther benefit resources\nWalgreens Retirement Savings Plan\nFidelity\nwww.netbenefits.com\nInvestments\n1.833.422.9247\nEarnIn Financial Service\nEarnIn\nwww.earnin.com\nAdded Benefits®\nWalgreens Added Benefits\nwww.walgreensaddedbenefits.com 1.844.800.8548\nDiscount programs\nPerkSpot\nhttps://walgreens.perkspot.com 1.866.606.6057\nPAGE LAST VIEWED\n2025_NHG_US STD 0325"
  },
  {
    "id": 133,
    "title": "Table 1",
    "content": "|  | BCBSIL myVirtualCare Access |  |\n| --- | --- | --- |\n|  | Tier 1 | Tier 2 |\n| Per Paycheck Costs | Low | Low |\n| PCP (age 18+) | $0 with Teladoc virtual care $0 copay in-person with referral from virtual PCP (including VillageMD) | $90 copay |\n| Pediatric Care (under 18) | $0 copay | $0 copay |\n| Mental Health Counseling | $0 copay with Teladoc virtual care $0 copay in-person with referral from virtual PCP (including VillageMD) | $90 copay |\n| Specialists | $0 copay with Teladoc virtual care $70 copay in-person with referral from virtual PCP (including VillageMD) | $120 copay |\n| Preventive Care | $0 copay | $0 copay |\n| Lab | $30 copay with referral from virtual PCP | $60 copay |\n| Basic Radiology | $100 copay with referral from virtual PCP | $150 copay |\n| High-Cost Radiology: Inpatient Care and Outpatient Care | 30% coinsurance after deductible with referral from virtual PCP | 40% coinsurance after deductible |\n| Outpatient | 30% coinsurance after deductible with referral from virtual PCP | 40% coinsurance after deductible |\n| Urgent Care | $0 copay with Teladoc virtual care $0 copay at VillageMD with referral from virtual PCP $100 copay in-person with referral from virtual PCP | 40% coinsurance after deductible |\n| Emergency Room | 30% coinsurance after deductible | 30% coinsurance after deductible |\n| Deductible (individual/family)* | $4,500/$9,000 | $6,500/$13,000 |\n| Out-of-Pocket Maximum (individual/family) | $9,000/$18,000 | $9,000/$18,000 |\n| Available Spending and Savings Account | Healthcare FSA | Healthcare FSA |\n"
  },
  {
    "id": 134,
    "title": "Table 2",
    "content": "|  | Copay Plans |  | HSA Plan |\n| --- | --- | --- | --- |\n|  | Copay Plan | Premier Copay Plan |  |\n| Per Paycheck Costs | Medium | High | Low |\n| Office Visit Copay | $20 PCP; $35 Specialist |  | Does not apply; office visits are subject to the deductible and coinsurance |\n| In-Network Preventive Care | Covered at 100%, no deductible |  | Covered at 100%, no deductible |\n| Deductible (individual/family) | $3,000/$6,000 | $750/$1,500 | $2,000/$4,000 |\n| Walgreens in-store clinic | $5 copay |  | Full price until you meet the deductible. $5 after deductible is met. However, you may be charged the full cost at the time of service or the $5 copay depending on the clinic. |\n| Outpatient Care | You pay 20% after deductible. |  | You pay 20% after deductible. |\n| Most other services | You pay 20% after deductible. |  | You pay 20% after deductible. |\n| Coinsurance | 20% after deductible |  | 20% after deductible |\n| Out-of-Pocket Maximum (individual/family) | $6,000/$12,000 | $3,500/$7,000 | $5,250/$10,500 |\n| Available Spending and Savings Accounts | Healthcare FSA |  | Health Savings Account Limited Purpose Healthcare FSA |\n"
  },
  {
    "id": 135,
    "title": "Table 3",
    "content": "|  | BCBSIL myVirtualCare Access |  | Copay Plans | HSA Plan |\n| --- | --- | --- | --- | --- |\n|  | Tier 1 | Tier 2 | Core Premier |  |\n| Preventive Drugs1 | $0 for preventive prescriptions |  | $0 for preventive prescriptions | $0 for certain preventive prescriptions |\n| Nonpreventive Drugs | You pay the lesser of the copay or the cost of the prescription. |  | You pay the lesser of the copay or the cost of the prescription. | Before you meet your plan deductible, you pay the full cost. After the plan deductible is met, you pay the lesser of the copay or the cost of the prescription. |\n"
  },
  {
    "id": 136,
    "title": "Table 4",
    "content": "|  | Prescription Drugs (30- to 90-day supplies) |  |\n| --- | --- | --- |\n|  | 30-Day Supply (Retail) | 90-Day Supply (Mail Order through Walgreens Mail Service or at Walgreens) |\n| Generic | $10 copay | $25 copay2 |\n| Brand Formulary | $25 copay | $50 copay |\n| Non-Formulary | $50 copay | $100 copay Fertility coverage |\n"
  },
  {
    "id": 137,
    "title": "Table 5",
    "content": "| Whom to Contact | Contact Information | Support Provided |\n| --- | --- | --- |\n| BCBSIL Health Advocate (Copay or HSA) | 1.800.247.9207 | · Care coordination program · Centers of Excellence · Clinical advocacy support, · Narrow network guidelines including targeted support for specific conditions · Claim appeals · Bill review · ID card requests · Claim status · Pre-authorization or predetermination of benefits |\n| UHC Care Coordinator (Copay or HSA) | 1.844.859.5007 |  |\n| BCBSIL | 1.855.453.4747 www.luminarehealth.com/walgreens/myvc Virtual PCP (select on the Blue Element Mobile IL mobile app or at myBlueElementIL.com) | Contact your Teladoc virtual PCP to coordinate your care |\n| myVirtualCare Access: Blue Cross Blue Shield of Illinois/Teladoc |  |  |\n"
  },
  {
    "id": 138,
    "title": "Table 6",
    "content": "| Medical Carrier | Telehealth Vendor | Cost | Website |\n| --- | --- | --- | --- |\n| BCBSIL myVirtualCare Access option |  |  |  |\n| Blue Cross Blue Shield (BCBSIL) | Teladoc Virtual PCP | $0 copay | www.luminarehealth. com/walgreens/myvc |\n| Copay or HSA medical options |  |  |  |\n| Blue Cross Blue Shield (BCBSIL) | Virtual Visits by 98point6 | $8 copay | www.98point6.com/ walgreens |\n| UnitedHealthcare (UHC) | Virtual Visits by 98point6 | $8 copay | www.98point6.com/ walgreens |\n| Dean / Prevea360 | Dean Health Plan Virtual Visits | Contact Dean for pricing | www.deancare.com/ wellness/care- management/virtual-visit |\n| Kaiser Permanente | My Doctor Online | Contact Kaiser for pricing | www.kp.org/getcare |\n"
  },
  {
    "id": 139,
    "title": "Table 7",
    "content": "| Group Critical Illness | Group Hospital Indemnity | Group Accident |\n| --- | --- | --- |\n| About the Plans |  |  |\n| · Pays a cash lump-sum payment if you are diagnosed with a covered critical illness. · The payment can be used for non-medical expenses that health insurance might not cover. · Benefit election payouts of 25% for autism and skin cancer. | · Pays a cash benefit that can be used to cover your out-of-pocket expenses in case of a covered hospitalization. . You can use the money toward deductibles, copays, premiums and even to help cover your daily living expenses. | · Pays cash benefits that correspond with hospital confinements due to a covered accident. · The cash benefits can be used to help pay for deductibles, treatment, house payments and more. Note: This coverage is offered in addition to the company's AD&D coverage. That coverage pays a lump-sum benefit to you or your designated beneficiaries if you die or become seriously injured in an accident. |\n| For more information about benefit payout amounts, view plan details at www.metlife.com/info/walgreens. | This product is HSA-compatible, so it works well with the HSA medical option, as well as the Copay medical options, to close gaps in coverage. Note: Benefits aren't paid for emergency room treatment or outpatient procedures. IMPORTANT: Refer to the MetLife Group Hospital Indemnity legal disclosure, available in the Resource Library on the Benefits Support Center website. |  |\n"
  },
  {
    "id": 140,
    "title": "Table 8",
    "content": "| Feature | Health Savings Account (HSA) | Healthcare Flexible Spending Account (FSA) | Dependent Care Flexible Spending Account (FSA) |\n| --- | --- | --- | --- |\n| 2025 contribution limits | · Contribute up to $4,300 individual or $8,500 family tax-free. · Plus an additional $1,000 catch-up contribution if age 55 or older. | · Contribute up to $3,300 tax-free. | · Contribute up to $5,000 per year (or $850 for highly compensated employees). |\n| What happens to unused funds? | · Use the money for eligible medical expenses now, or save it for the future, even into retirement. · Unused HSA dollars carry over from year to year. . Bank account that you own and manage. Any contributions belong to you even if you leave the company or retire. | · For 2025, you have until December 31, 2025 to incur eligible healthcare expenses. Claims must be submitted by March 31 of the year after the claim was incurred. · You can carry over up to $660 of your unused balance from 2025 to 2026, but you must re-enroll in the healthcare FSA to be eligible. If you don't re-enroll, any carryover balance from 2025 will be forfeited March 31, 2026. | · Unused funds don't carry over from year to year, so plan carefully. · Claims must be submitted by March 31 of the year after the claim was incurred. |\n| You can use it for | Qualified medical expenses, such as: · Doctor's office visits · Dental care · Vision care · Prescription medications · Chiropractic services · Acupuncture · Hearing aids and batteries · Contact lenses/eyeglasses For a full list of qualified medical expenses, visit irs.gov. | Designed for health, prescription drug, dental and vision out-of-pocket expenses, such as: · Doctor's office visits · Dental care · Vision care · Prescription medications · Chiropractic services · Acupuncture · Hearing aids and batteries · Contact lenses/eyeglasses For a full list of qualified medical expenses, visit irs.gov. Note: If you choose the HSA medical plan, only a Limited Purpose Healthcare FSA is available for dental and vision expenses until you meet your medical plan deductible. | Designed for expenses related to care of a child or dependent adult so you (and your spouse, if married) can work or attend school full-time. Eligible expenses include: · General child care · Before- and after-school care · Summer day camp · Elder care Find a complete list of eligible dependent care expenses at irs.gov/publications/p503. |\n"
  },
  {
    "id": 141,
    "title": "Table 9",
    "content": "| Feature | Health Savings Account (HSA) | Healthcare Flexible Spending Account (FSA) | Dependent Care Flexible Spending Account (FSA) |\n| --- | --- | --- | --- |\n| Other details | · Must enroll in the HSA plan. · You can change your HSA election throughout the year. · Funding your HSA with automatic payroll deductions lowers your taxable income. . As your HSA balance grows, any interest you earn is also tax-free. . You'll receive an HSA debit card from Optum Bank that makes it easy to access your account. . You can only use funds from your HSA after they've been deposited into your account. · To be eligible for the HSA, you can't be covered by Medicaid, Medicare or another non-HDHP medical plan. · While domestic partners are eligible for coverage under an HSA option, HSA reimbursements for their out-of-pocket medical costs aren't considered eligible medical expenses (per the IRS) and will be taxed. | · The total amount you choose to contribute for the year is taken out of your paycheck over time, but you get the full amount for use as soon as your coverage takes effect. . You can't change your Healthcare FSA election mid-year unless you experience a qualifying life event. | · The total amount you choose to contribute for the year is taken out of your paycheck over time; you can only request reimbursements for up to the amount you've already contributed for the year. · It's a good idea to speak with a tax professional to determine if the Dependent Care FSA or the federal tax credit provides you with the greatest savings. |\n"
  },
  {
    "id": 142,
    "title": "Table 10",
    "content": "|  | Commuter Benefit Plan |\n| --- | --- |\n| How it works | · Set aside money on a pre-tax basis to pay the cost of parking and/or using public transportation or vanpool to and from work. · You save money on taxes, because deductions are taken from your paycheck before taxes are calculated. |\n|  | . You can enroll or make changes to your Commuter Benefit Plan elections at any time, not just during Open Enrollment. . You can enroll from the 4th of one month to the 3rd of the next month, for the following benefit month. |\n| Use it or lose it | Unused funds will be forfeited when you leave the company. |\n| You can use it for | Work-related transportation costs for: · Parking · Ferry · Train · Trolley · Bus · Vanpool · Subway |\n"
  },
  {
    "id": 143,
    "title": "Table 11",
    "content": "|  | Value PPO Dental | Premier PPO Dental | Exclusive Network Dental Plan (ENDP) |\n| --- | --- | --- | --- |\n| Annual Deductible (individual/family) | $75 per person up to $225 annual maximum | $25 per person up to $75 annual maximum | None |\n| Annual Maximum | $1,000 per person | $2,500 per person | None |\n| Preventive Services | 100%, no deductible | 100%, no deductible | 100% |\n| Basic Services | You pay 20% after deductible | You pay 20% after deductible | Copay varies by service |\n| Restorative Care | Minor: You pay 20% after deductible Major: You pay 50% after deductible | You pay 20% after deductible | Copay varies by service |\n| Orthodontia | Not covered | 50% up to $2,500 lifetime maximum per person (adult and children) | Copay of $1,850-$1,950 |\n"
  },
  {
    "id": 144,
    "title": "Table 12",
    "content": "|  | Value Vision | Premier Vision |\n| --- | --- | --- |\n| Type of Plan | PPO Plan that covers both in- and out-of-network benefits | PPO Plan that covers both in- and out-of-network benefits |\n| Pay now or pay later? | Lower paycheck contributions, higher copays and coinsurance | Higher paycheck contributions, lower copays and coinsurance |\n| Routine Vision Exam (once per plan year) | $20 copay; 20% discount on the amount over the $130 allowance | $10 copay; 20% discount on the amount over the $200 allowance |\n| Frames (once per plan year) | $0 copay; 20% discount on the amount over the $130 allowance | $0 copay; 20% discount on the amount over the $200 allowance |\n| Lenses (once per plan year; premium lenses may cost more) |  |  |\n| Single Vision | $20 copay | $10 copay |\n| Bifocal | $20 copay | $10 copay |\n| Trifocal | $20 copay | $10 copay |\n| Lenticular | $20 copay | $10 copay |\n| Progressive Standard | $20 copay | $10 copay |\n| Progressive Premium Tier 1 | $50 copay | $40 copay |\n| Progressive Premium Tier 2 | $60 copay | $50 copay |\n| Progressive Premium Tier 3 | $75 copay | $65 copay |\n| Progressive Premium Tier 4 | $235 copay | $225 copay |\n| Contact Lenses (contact lens allowance includes materials only) |  |  |\n| Conventional | $0 copay; 15% discount on the amount over the $130 allowance | $0 copay; 20% discount on the amount over the $200 allowance |\n| Disposable | $0 copay; member pays full amount over the $130 allowance | $0 copay; member pays full amount over the $200 allowance |\n| Medically Necessary | $0 copay; paid in full | $0 copay; paid in full |\n| Lens Options |  |  |\n| Anti Reflective Coating | $45-$100 copay | $45-$100 copay |\n| Polycarbonate (under 19 years of age) | $0 copay | $0 copay |\n| Polycarbonate (19 years and over) | Not covered | $15 copay |\n"
  },
  {
    "id": 145,
    "title": "Table 13",
    "content": "| KinderCare Education includes | The Learning Care Group |\n| --- | --- |\n| the following providers: | includes the following providers: |\n| · KinderCare | · Tutor Time |\n| · Knowledge Beginnings | · Child Time |\n| · Champions Before and After | · Children's Courtyard |\n| School Program | · Montessori Unlimited |\n|  | · LaPetite Academy · Creative Kids |\n"
  },
  {
    "id": 146,
    "title": "Table 14",
    "content": "| General support |  |\n| --- | --- |\n| Benefits Support Center (Alight Solutions) | www.BenefitsSupportCenter.com |\n|  | 1.855.564.6153 |\n|  | (Representatives are available from 8 a.m. to 5 p.m. Central time, Monday through Friday) |\n"
  },
  {
    "id": 147,
    "title": "Table 15",
    "content": "| Medical and prescription drug coverage |  |  |  |\n| --- | --- | --- | --- |\n| National carriers |  | Regional carriers |  |\n| Blue Cross Blue Shield of Illinois | www.bcbsil.com/walgreens 1.800.247.9207 | Dean / Prevea360 | http://aon.deanhealthplan.com 1.877.232.9375 |\n| UnitedHealthcare | www.myuhc.com 1.844.859.5007 | Kaiser Permanente | http://www.kp.org Pre-enrollment: 1.877.580.6125 |\n| BCBSIL myVirtualCare Access: Blue Cross Blue Shield of Illinois/Teladoc | www.luminarehealth.com/walgreens/myvc 1.855.453.4747 |  | Ongoing: CA: 1.800.464.4000 CO: 1.303.338.3800 Mid-Atlantic: 1.800.777.7902 Northwest: 1.800.813.2000 SBC: 1.855.249.5005 |\n| OptumRx (Pharmacy Benefit Manager) | Pre-enrollment: welcome.optumrx.com/walgreens Ongoing: optumrx.com 1.855.376.3214 |  |  |\n| Walgreens Mail Service | www.walgreensmailservice.com 1.877.787.3047 Call center is available 24/7 |  |  |\n| Walgreens Specialty Pharmacy | www.walgreensspecialtyrx.com 1.800.516.9180 |  |  |\n"
  },
  {
    "id": 148,
    "title": "Table 16",
    "content": "| Dental coverage |  |\n| --- | --- |\n| UnitedHealthcare | www.myuhc.com 1.866.660.7181 |\n"
  },
  {
    "id": 149,
    "title": "Table 17",
    "content": "| Vision coverage |  |\n| --- | --- |\n| EyeMed | https://member.eyemedvisioncare.com/walgreens 1.844.844.0896 |\n"
  },
  {
    "id": 150,
    "title": "Table 18",
    "content": "| Specialized care programs |  |\n| --- | --- |\n| Carrum Health Medical and Surgery Benefit | Carrum.me/Walgreens 1.888.855.7806 |\n| Hinge Health | hingehealth.com/walgreens 1.855.902.2777 |\n| Vida Health | www.vida.com/walgreens 1.855.442.5885 |\n"
  },
  {
    "id": 151,
    "title": "Table 19",
    "content": "| Spending and savings accounts |  |\n| --- | --- |\n| Flexible Spending Accounts |  |\n| Optum | www.OptumBank.com or download the Optum mobile app |\n|  | 1.800.243.5543 |\n| Commuter Benefit Plan |  |\n| Optum | www.OptumBank.com or download the Optum mobile app |\n|  | 1.877.462.5039 |\n| Health Savings Account |  |\n| Optum Bank | www.OptumBank.com or download the Optum Bank mobile app 1.866.234.8913 |\n"
  },
  {
    "id": 152,
    "title": "Table 20",
    "content": "| Family forming benefits |  |\n| --- | --- |\n| Adoption and Surrogacy Reimbursement Program |  |\n| Your Spending Account (through the Benefits | www.BenefitsSupportCenter.com 1.855.564.6153 |\n| Support Center) |  |\n"
  },
  {
    "id": 153,
    "title": "Table 21",
    "content": "| Life, AD&D and supplemental benefits |  |\n| --- | --- |\n| Life Insurance, AD&D, and Group Accident | Group Critical Illness, Group Hospital Indemnity |\n| MetLife | www.metlife.com/info/walgreens 1.833.891.5433 (for policy questions, inquiries and claims) . Life and AD&D Claims: Press 1 |\n|  | · Statement of Health or Evidence of Insurability: Press 2 . Critical Illness, Hospital Indemnity or Accident Insurance: Press 3 |\n"
  },
  {
    "id": 154,
    "title": "Table 22",
    "content": "| Allstate Customer | mybenefits.allstate.com |\n| --- | --- |\n| Care Center | 1.866.828.8501 |\n"
  },
  {
    "id": 155,
    "title": "Table 23",
    "content": "| Other benefit resources |  |  |\n| --- | --- | --- |\n| High touch support with healthcare questions |  |  |\n| Medical Carrier's Care Coordination Program | BCBSIL my VirtualCare Access virtual PCP | Select on the Blue Element Mobile IL mobile app or at myBlueElementIL.com |\n|  | BCBSIL Health Advocate (Copay or HSA option) | 1.800.247.9207 |\n|  | UHC Care Coordinator (Copay or HSA option) | 1.844.859.5007 |\n| Life365 EAP |  |  |\n| CuraLinc | www.walgreenslife365.com GROUP CODE: life365 1.855.777.0078 |  |\n"
  },
  {
    "id": 156,
    "title": "Table 24",
    "content": "| Other benefit resources |  |\n| --- | --- |\n| Walgreens Retirement Savings Plan |  |\n| Fidelity | www.netbenefits.com |\n| Investments | 1.833.422.9247 |\n| EarnIn Financial Service |  |\n| EarnIn | www.earnin.com |\n| Added Benefits® |  |\n| Walgreens Added Benefits | www.walgreensaddedbenefits.com 1.844.800.8548 |\n| Discount programs |  |\n| PerkSpot | https://walgreens.perkspot.com 1.866.606.6057 |\n"
  }
]